<!doctype html>



  


<html class="theme-next mist use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="心得体会," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="在前端摸爬滚打已经两个年头，说长不长说短不短，一直想写点什么记录一下自己的成长，刚好看到早读君的活动，起身动笔。至于个人信息，当然已经略去…

 两年半前，带着想进IT行业想学计算机的想法入了华农的网络工程专业（然后回家都会被人问..呀跑去耕田了么…），稀里糊涂的开始了各种计算机基础理论课。然而一行行的代码，仅仅是在黑白屏之间跳跃，作为一个从小喜欢美术自认为有些艺术细胞的我，实在觉得枯燥对于课程也">
<meta property="og:type" content="article">
<meta property="og:title" content="前端之旅">
<meta property="og:url" content="http://cyseria.xyz/2016/03/05/my-way/index.html">
<meta property="og:site_name" content="鳗鱼鱼 | blog">
<meta property="og:description" content="在前端摸爬滚打已经两个年头，说长不长说短不短，一直想写点什么记录一下自己的成长，刚好看到早读君的活动，起身动笔。至于个人信息，当然已经略去…

 两年半前，带着想进IT行业想学计算机的想法入了华农的网络工程专业（然后回家都会被人问..呀跑去耕田了么…），稀里糊涂的开始了各种计算机基础理论课。然而一行行的代码，仅仅是在黑白屏之间跳跃，作为一个从小喜欢美术自认为有些艺术细胞的我，实在觉得枯燥对于课程也">
<meta property="og:updated_time" content="2016-09-10T03:09:04.985Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="前端之旅">
<meta name="twitter:description" content="在前端摸爬滚打已经两个年头，说长不长说短不短，一直想写点什么记录一下自己的成长，刚好看到早读君的活动，起身动笔。至于个人信息，当然已经略去…

 两年半前，带着想进IT行业想学计算机的想法入了华农的网络工程专业（然后回家都会被人问..呀跑去耕田了么…），稀里糊涂的开始了各种计算机基础理论课。然而一行行的代码，仅仅是在黑白屏之间跳跃，作为一个从小喜欢美术自认为有些艺术细胞的我，实在觉得枯燥对于课程也">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"left","display":"hide"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://cyseria.xyz/2016/03/05/my-way/"/>

  <title> 前端之旅 | 鳗鱼鱼 | blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">鳗鱼鱼 | blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">鳗鱼鱼的博客</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                前端之旅
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-03-05T23:35:02+08:00" content="2016-03-05">
              2016-03-05
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/心得体会/" itemprop="url" rel="index">
                    <span itemprop="name">心得体会</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/03/05/my-way/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/03/05/my-way/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <blockquote>
<p>&#x5728;&#x524D;&#x7AEF;&#x6478;&#x722C;&#x6EDA;&#x6253;&#x5DF2;&#x7ECF;&#x4E24;&#x4E2A;&#x5E74;&#x5934;&#xFF0C;&#x8BF4;&#x957F;&#x4E0D;&#x957F;&#x8BF4;&#x77ED;&#x4E0D;&#x77ED;&#xFF0C;&#x4E00;&#x76F4;&#x60F3;&#x5199;&#x70B9;&#x4EC0;&#x4E48;&#x8BB0;&#x5F55;&#x4E00;&#x4E0B;&#x81EA;&#x5DF1;&#x7684;&#x6210;&#x957F;&#xFF0C;&#x521A;&#x597D;&#x770B;&#x5230;&#x65E9;&#x8BFB;&#x541B;&#x7684;&#x6D3B;&#x52A8;&#xFF0C;&#x8D77;&#x8EAB;&#x52A8;&#x7B14;&#x3002;&#x81F3;&#x4E8E;&#x4E2A;&#x4EBA;&#x4FE1;&#x606F;&#xFF0C;&#x5F53;&#x7136;&#x5DF2;&#x7ECF;&#x7565;&#x53BB;&#x2026;</p>
</blockquote>
<p> &#x4E24;&#x5E74;&#x534A;&#x524D;&#xFF0C;&#x5E26;&#x7740;&#x60F3;&#x8FDB;IT&#x884C;&#x4E1A;&#x60F3;&#x5B66;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x60F3;&#x6CD5;&#x5165;&#x4E86;&#x534E;&#x519C;&#x7684;&#x7F51;&#x7EDC;&#x5DE5;&#x7A0B;&#x4E13;&#x4E1A;&#xFF08;&#x7136;&#x540E;&#x56DE;&#x5BB6;&#x90FD;&#x4F1A;&#x88AB;&#x4EBA;&#x95EE;..&#x5440;&#x8DD1;&#x53BB;&#x8015;&#x7530;&#x4E86;&#x4E48;&#x2026;&#xFF09;&#xFF0C;&#x7A00;&#x91CC;&#x7CCA;&#x6D82;&#x7684;&#x5F00;&#x59CB;&#x4E86;&#x5404;&#x79CD;&#x8BA1;&#x7B97;&#x673A;&#x57FA;&#x7840;&#x7406;&#x8BBA;&#x8BFE;&#x3002;&#x7136;&#x800C;&#x4E00;&#x884C;&#x884C;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4EC5;&#x4EC5;&#x662F;&#x5728;&#x9ED1;&#x767D;&#x5C4F;&#x4E4B;&#x95F4;&#x8DF3;&#x8DC3;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x4ECE;&#x5C0F;&#x559C;&#x6B22;&#x7F8E;&#x672F;&#x81EA;&#x8BA4;&#x4E3A;&#x6709;&#x4E9B;&#x827A;&#x672F;&#x7EC6;&#x80DE;&#x7684;&#x6211;&#xFF0C;&#x5B9E;&#x5728;&#x89C9;&#x5F97;&#x67AF;&#x71E5;&#x5BF9;&#x4E8E;&#x8BFE;&#x7A0B;&#x4E5F;&#x53EA;&#x662F;&#x5904;&#x4E8E;&#x597D;&#x597D;&#x5B66;&#x4E60;&#x5E76;&#x672A;&#x6DF1;&#x7A76;&#x7684;&#x9636;&#x6BB5;&#x3002;</p>
<p>&#x518D;&#x8BF4;&#x771F;&#x6B63;&#x63A5;&#x89E6;&#x524D;&#x7AEF;&#xFF0C; &#x4ECE;&#x5927;&#x4E00;&#x7684;&#x4E00;&#x6B21;&#x7F51;&#x9875;&#x6BD4;&#x8D5B;&#x8BBE;&#x8BA1;&#x5F00;&#x59CB;&#xFF0C;&#x4E3A;&#x4E86;&#x54CD;&#x5E94;&#x5B66;&#x6821;&#x7684;&#x53F7;&#x53EC;&#x53D1;&#x6325;&#x81EA;&#x5DF1;&#x591A;&#x5E74;&#x7684;&#x8BBE;&#x8BA1;&#x624D;&#x80FD;&#xFF08;&#x6211;&#x624D;&#x4E0D;&#x4F1A;&#x8BF4;&#x662F;&#x770B;&#x4E2D;&#x4ED6;&#x7684;&#x5956;&#x91D1;&#x5462;&#xFF08;&#x54B3;&#x54B3;&#x2026;&#xFF09;&#xFF0C;&#x8BBE;&#x8BA1;&#x4E86;&#x4E00;&#x4E2A;&#x5F53;&#x65F6;&#x81EA;&#x8BA4;&#x4E3A;&#x4E0D;&#x9519;&#x7684;&#x7F51;&#x7AD9;&#x7136;&#x540E;&#x4E00;&#x4E24;&#x661F;&#x671F;&#x5728;w3cschool&#x4E0A;&#x901F;&#x6210;&#x4E86;html+css&#xFF0C;&#x5F53;&#x7136;&#x2026;.&#x7ED3;&#x679C;&#x662F;&#x8DDF;&#x5927;&#x5956;&#x65E0;&#x7F18;&#x3002;&#x4E0D;&#x8FC7;&#x4E5F;&#x6B63;&#x662F;&#x8FD9;&#x4E00;&#x6B21;&#x7ECF;&#x5386;&#xFF0C;&#x8BA9;&#x6211;&#x53D1;&#x73B0;&#x4E86;&#x539F;&#x6765;&#x8BED;&#x8A00;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x8FD0;&#x884C;&#x5728;&#x63A7;&#x5236;&#x53F0;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x7528;&#x4E86;&#xFF0C;&#x539F;&#x6765;&#x6709;&#x8FD9;&#x4E48;&#x795E;&#x5947;&#x7684;&#x4E1C;&#x897F;&#x5B58;&#x5728;&#xFF0C;&#x539F;&#x6765;&#x6211;&#x60F3;&#x7684;&#x6211;&#x753B;&#x7684;&#x4E1C;&#x897F;&#x53EF;&#x4EE5;&#x771F;&#x5B9E;&#x7684;&#x663E;&#x793A;&#x5728;&#x7F51;&#x9875;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x90A3;&#x4E48;&#x9177;&#x70AB;&#x7684;&#x52A8;&#x8D77;&#x6765;&#x3002;&#x63A5;&#x7740;&#x7684;&#x5267;&#x60C5;&#x53EF;&#x60F3;&#x800C;&#x77E5;&#x2026;.&#x5728;&#x6F2B;&#x6F2B;&#x524D;&#x7AEF;&#x8DEF;&#x4E0A;&#x4E00;&#x53D1;&#x4E0D;&#x53EF;&#x6536;&#x62FE;&#xFF0C;&#x767D;&#x5929;&#x4E0A;&#x8BFE;&#xFF0C;&#x665A;&#x4E0A;&#x65F6;&#x5E38;&#x770B;&#x6587;&#x6863;&#x770B;&#x6559;&#x7A0B;&#x770B;&#x535A;&#x5BA2;&#x5230;&#x4E00;&#x4E24;&#x70B9;&#xFF08;&#x8FD9;&#x70B9;&#x5927;&#x5BB6;&#x4E0D;&#x8981;&#x5B66;&#x8FD8;&#x662F;&#x8EAB;&#x4F53;&#x91CD;&#x8981;&#xFF09;&#x3002;</p>
<a id="more"></a>
<p>&#x56E0;&#x4E3A;&#x5B66;&#x6821;&#x5E76;&#x6CA1;&#x6709;&#x524D;&#x7AEF;&#x7CFB;&#x5217;&#x5316;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x6240;&#x4EE5;&#x5B66;&#x4E60;&#x4E5F;&#x57FA;&#x672C;&#x90FD;&#x662F;&#x9760;&#x7740;&#x81EA;&#x5B66;&#x3002;&#x8BA4;&#x8BC6;&#x4E00;&#x4E9B;&#x540C;&#x5728;&#x524D;&#x7AEF;&#x8DEF;&#x4E0A;&#x7684;&#x5E08;&#x5144;&#xFF0C;&#x5F00;&#x59CB;&#x8DDF;&#x6211;&#x4ECB;&#x7ECD;&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5DE5;&#x5177;&#xFF08;&#x521A;&#x5F00;&#x59CB;&#x4E00;&#x4E24;&#x4E2A;&#x661F;&#x671F;&#x88AB;&#x5EFA;&#x8BAE;&#x662F;&#x7528;&#x5199;&#x5B57;&#x672C;&#x7684;&#x7136;&#x540E;&#x4E5F;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E;&#x5E38;&#x7528;&#x7684;&#x5C5E;&#x6027;&#x5168;&#x62FC;&#x90FD;&#x6CA1;&#x591A;&#x5927;&#x95EE;&#x9898;&#xFF0C;&#x5F53;&#x7136;&#x540E;&#x6765;&#x5C31;&#x6362;&#x6210;&#x4E86;&#x5927;&#x540D;&#x9F0E;&#x9F0E;&#x7684;sublime&#xFF09;&#xFF0C;&#x5F00;&#x59CB;&#x6309;&#x7740;F12&#x53BB;&#x6A21;&#x4EFF;&#x7F51;&#x7AD9;&#x53BB;&#x4E86;&#x89E3;&#x5E03;&#x5C40;&#x53BB;&#x5224;&#x522B;&#x7EDD;&#x5BF9;&#x5B9A;&#x4F4D;&#x76F8;&#x5BF9;&#x5B9A;&#x4F4D;&#x6709;&#x4EC0;&#x4E48;&#x4E0D;&#x540C;&#x3002;&#x671F;&#x95F4;&#xFF0C;&#x4E3B;&#x8981;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x4E0D;&#x505C;&#x7684;&#x7FFB;&#x6587;&#x6863;&#xFF0C;&#x7EC3;&#x4E60;&#xFF0C;&#x4E0D;&#x61C2;&#x7684;&#x767E;&#x5EA6;&#x67E5;google&#x67E5;&#x5404;&#x79CD;&#x95EE;&#xFF0C;&#x5927;&#x6982;&#x8FD9;&#x79CD;&#x72B6;&#x6001;&#x82B1;&#x4E86;&#x4E00;&#x4E24;&#x4E2A;&#x6708;&#x57FA;&#x672C;&#x80FD;&#x505A;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x6392;&#x7248;&#x5E03;&#x5C40;&#x8FD8;&#x80FD;&#x505A;&#x70B9;&#x7B80;&#x5355;&#x7279;&#x6548;&#x4E86;&#xFF0C;&#x5927;&#x4E00;&#x6691;&#x5047;&#x8DDF;&#x7740;&#x8001;&#x5E08;&#x505A;&#x4E86;&#x4E00;&#x4E2A;<a href="http://www.lookyi.com/" target="_blank" rel="external">&#x5173;&#x4E8E;&#x827A;&#x4EBA;&#x7B7E;&#x7EA6;&#x6F14;&#x51FA;&#xFF08;&#x201C;&#x8D29;&#x5356;&#x4EBA;&#x53E3;&#x201D;&#xFF09;</a>&#x7684;&#x9879;&#x76EE;&#xFF08;&#x6B64;&#x523B;&#xFF0C;&#x524D;&#x7AEF;&#x5165;&#x95E8;&#x7684;&#x65B0;&#x624B;&#x4EFB;&#x52A1;&#x5B8C;&#x6210;&#xFF09;</p>
<p>&#x518D;&#x8BF4;&#x8BF4;js&#xFF0C;&#x4ECE;w3cschool&#x7684;&#x76F8;&#x5173;&#x5185;&#x5BB9;&#x548C;&#x300A;Javascript Dom&#x7F16;&#x7A0B;&#x827A;&#x672F;&#x300B;&#x5F00;&#x59CB;&#x5165;&#x95E8;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;c&#x548C;java&#x7684;&#x7F16;&#x7A0B;&#x57FA;&#x7840;&#xFF0C;&#x6240;&#x4EE5;&#x5B66;&#x8D77;&#x6765;&#x5E76;&#x4E0D;&#x662F;&#x5F88;&#x56F0;&#x96BE;&#xFF0C;&#x4E0D;&#x7528;&#x591A;&#x4E45;&#x5C31;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#x80FD;&#x5B9E;&#x73B0;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x7684;&#x52A8;&#x753B;&#x53EF;&#x4EE5;&#x5199;&#x4E00;&#x4E9B;&#x5C0F;&#x73A9;&#x610F;&#x4E86;&#xFF08;&#x6BD4;&#x5982;&#x5012;&#x8BA1;&#x65F6;&#x4E4B;&#x7C7B;&#x7684;&#xFF09;&#xFF0C;&#x6B64;&#x65F6;&#x6210;&#x5C31;&#x611F;max&#x7684;&#x50CF;&#x662F;&#x770B;&#x7740;&#x81EA;&#x5DF1;&#x7684;&#x5C0F;&#x5B69;&#x5B66;&#x4F1A;&#x4E86;&#x8D70;&#x8DEF;&#x4E00;&#x6837;&#xFF08;&#x7537;&#x670B;&#x53CB;&#x90FD;&#x6CA1;&#x62FF;&#x6765;&#x5C0F;&#x5B69;&#x2026;&#x6454;&#x2026;&#xFF09;&#x4E0D;&#x8FC7;&#x8DDF;&#x6E38;&#x620F;&#x4E00;&#x6837;&#xFF0C;&#x5F53;&#x4F60;&#x6210;&#x529F;&#x95EF;&#x5B8C;&#x4E86;&#x4E00;&#x5173;&#x6253;&#x8D25;&#x4E86;boss&#xFF0C;&#x5F80;&#x5F80;&#x4E0B;&#x9762;&#x7684;&#x5173;&#x5361;&#x96BE;&#x5EA6;&#x7B49;&#x7EA7;&#x4E5F;&#x5F00;&#x59CB;&#x63D0;&#x9AD8;&#x3002;&#x53C8;&#x7EE7;&#x7EED;&#x770B;&#x6587;&#x6863;&#x5B66;&#x4E86;jq&#x4E4B;&#x540E;&#xFF0C;&#x53D1;&#x73B0;&#x6574;&#x4E2A;&#x4EBA;&#x8DDF;&#x5F00;&#x4E86;&#x5916;&#x6302;&#x4E00;&#x6837;&#xFF0C;&#x8170;&#x4E0D;&#x9178;&#x4E86;&#x817F;&#x4E0D;&#x75BC;&#x4E86;&#xFF0C;&#x4E0D;&#x7528;&#x6BCF;&#x5929;&#x53BB;&#x5199;document.getElementById(id)&#x8FD9;&#x4E48;&#x957F;&#x7684;&#x4E1C;&#x897F;&#x4E86;&#x3002;&#x7EE7;&#x7EED;&#x505A;&#x9879;&#x76EE;&#x6CA1;&#x9879;&#x76EE;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x81EA;&#x5DF1;&#x627E;&#x4E8B;&#x505A;&#xFF0C;&#x4E0D;&#x8FC7;&#x56E0;&#x4E3A;&#x5927;&#x4E8C;&#x7684;&#x8BFE;&#x4E0D;&#x662F;&#x4E00;&#x822C;&#x591A;&#xFF08;&#x4E00;&#x661F;&#x671F;&#x4ECE;&#x65E9;&#x4E0A;&#x516B;&#x70B9;&#x5230;&#x665A;&#x4E0A;&#x5341;&#x70B9;&#x5C31;&#x4E09;&#x8282;&#x7A7A;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x5927;&#x591A;&#x8001;&#x5E08;&#x559C;&#x6B22;&#x70B9;&#x540D;&#x559C;&#x6B22;&#x4E0D;&#x5B9A;&#x65F6;&#x5802;&#x6D4B;&#xFF09;&#xFF0C;&#x6280;&#x80FD;&#x70B9;&#x5E76;&#x6CA1;&#x6709;&#x98DE;&#x901F;&#x53D1;&#x5C55;&#x3002;&#x5229;&#x7528;&#x96F6;&#x6563;&#x7684;&#x65F6;&#x95F4;&#x5B66;&#x4F1A;&#x4E86;ajax&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x770B;&#x7740;&#x6559;&#x7A0B;&#x4E66;&#x7528;canvas&#x5199;&#x4E86;&#x4E00;&#x4E2A;&#x4FC4;&#x7F57;&#x65AF;&#x65B9;&#x5757;&#xFF0C;&#x5F00;&#x59CB;&#x63A5;&#x89E6;css3&#xFF0C;&#x5B66;&#x4F1A;&#x4E86;&#x54CD;&#x5E94;&#x5F0F;&#x5E03;&#x5C40;&#xFF0C;&#x518D;&#x6709;&#x5C31;&#x662F;jq&#x7684;&#x4F7F;&#x7528;&#x5F00;&#x59CB;&#x5F00;&#x59CB;&#x719F;&#x7EC3;&#xFF08;&#x5E38;&#x7528;&#x51FD;&#x6570;&#x57FA;&#x672C;&#x8BB0;&#x5F97;&#xFF0C;&#x4E0D;&#x8BB0;&#x5F97;&#x7684;&#x53BB;&#x7FFB;&#x6587;&#x6863;&#x4E5F;&#x77E5;&#x9053;&#x5927;&#x6982;&#x5728;&#x54EA;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF09;&#x6691;&#x5047;&#x7684;&#x65F6;&#x5019;&#x5728;&#x4E00;&#x4E2A;&#x516C;&#x53F8;&#x5B9E;&#x4E60;&#x4E86;&#x4E00;&#x4E2A;&#x6708;&#xFF0C;&#x518D;&#x6709;&#x63A5;&#x4E86;&#x4E00;&#x4E2A;&#x5916;&#x5305;&#x7684;&#x9879;&#x76EE;&#xFF08;&#x5185;&#x90E8;&#x6210;&#x5458;&#x5197;&#x6742;&#xFF0C;&#x6D77;&#x5185;&#x6D77;&#x5916;&#x5B66;&#x751F;&#x5927;&#x89E6;&#x90FD;&#x6709;&#xFF09;&#x4E5F;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x9879;&#x76EE;&#x8BA9;&#x6211;&#x53D1;&#x73B0;&#x4E86;&#x4EBA;&#x4E0E;&#x4EBA;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x8DDD;&#xFF09;&#xFF0C;&#x5F00;&#x59CB;&#x601D;&#x8003;&#x4EBA;&#x751F;&#xFF0C;&#x9047;&#x5230;&#x4E86;&#x4F20;&#x8BF4;&#x4E2D;&#x7684;&#x74F6;&#x9888;&#x3002;&#x4E00;&#x76F4;&#x7684;&#x5B66;&#x4E60;&#xFF0C;&#x53EA;&#x662F;&#x7EAF;&#x7CB9;&#x7684;&#x50CF;&#x5C0F;&#x5B69;&#x5B50;&#x95F9;&#x8FC7;&#x5BB6;&#x5BB6;&#x90A3;&#x6837;&#xFF0C;&#x867D;&#x7136;&#x662F;&#x5174;&#x8DA3;&#x7684;&#x9A71;&#x4F7F;&#xFF0C;&#x4F46;&#x5C31;&#x662F;&#x8FD9;&#x8FB9;&#x73A9;&#x73A9;&#x90A3;&#x8FB9;&#x73A9;&#x73A9;&#xFF0C;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x662F;&#x7CBE;&#x901A;&#x7684;&#x3002;&#x4F1A;&#x91CD;&#x6784;&#x4F1A;jq&#xFF0C;&#x57FA;&#x672C;&#x5728;&#x5B66;&#x6821;&#x8001;&#x5E08;&#x7ED9;&#x7684;&#x7F51;&#x7AD9;&#x9879;&#x76EE;&#x57FA;&#x672C;&#x5B9E;&#x73B0;&#x90FD;&#x4E0D;&#x4F1A;&#x6709;&#x591A;&#x5927;&#x95EE;&#x9898;&#xFF0C;&#x6709;&#x79CD;&#x7A77;&#x9014;&#x672B;&#x8DEF;&#x7684;&#x611F;&#x89C9;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8EAB;&#x8FB9;&#x7684;&#x633A;&#x591A;&#x90FD;&#x8FD8;&#x505C;&#x7559;&#x5728;&#x8BFE;&#x672C;&#x9636;&#x6BB5;&#xFF0C;&#x90FD;&#x89C9;&#x5F97;&#x4F60;&#x662F;&#x5927;&#x795E;&#xFF0C;&#x4E5F;&#x627E;&#x4E0D;&#x5230;&#x591A;&#x5C11;&#x53EF;&#x4EE5;&#x5410;&#x69FD;&#x7684;&#x5BF9;&#x5BF9;&#x8C61;&#x3002;&#x5C31;&#x8FD9;&#x6837;&#x8FF7;&#x832B;&#x7684;&#x7EA0;&#x7ED3;&#x7740;&#xFF0C;&#x8DDF;&#x8001;&#x5E08;&#x505A;&#x505A;&#x9879;&#x76EE;&#xFF0C;&#x91CD;&#x590D;&#x7684;&#x673A;&#x68B0;&#x7684;&#x6392;&#x7248;&#x5E03;&#x5C40;&#xFF0C;&#x7EE7;&#x7EED;&#x524D;&#x884C;&#x2026;.</p>
<p>&#x518D;&#x5230;&#x5927;&#x4E09;&#xFF0C;&#x5173;&#x6CE8;&#x4E86;&#x5F88;&#x591A;&#x5173;&#x4E8E;&#x524D;&#x7AEF;&#x7684;&#x516C;&#x4F17;&#x53F7;&#xFF0C;&#x5FAE;&#x535A;&#xFF0C;&#x535A;&#x5BA2;&#xFF0C;&#x6BCF;&#x5929;&#x53BB;&#x6D4F;&#x89C8;&#xFF0C;&#x4E5F;&#x8BB8;&#x662F;&#x89C6;&#x91CE;&#x5BBD;&#x9614;&#x4E86;&#xFF0C;&#x7A81;&#x7136;&#x53D1;&#x73B0;&#x6EE1;&#x4E16;&#x754C;&#x5F00;&#x59CB;&#x5927;&#x8C08;less,sass,postcss&#xFF0C;&#x8C08;grunt&#x5230;glup&#xFF0C;&#x8C08;node.js&#xFF0C;&#x8C08;Agular&#x8C08;React&#xFF0C;&#x8C08;&#x6027;&#x80FD;&#x4F18;&#x5316;&#x8C08;&#x5404;&#x79CD;&#x9002;&#x914D;&#x3002;&#x4E5F;&#x8BB8;&#x521A;&#x5F00;&#x59CB;&#x4F1A;&#x88AB;&#x5413;&#x5230;&#xFF0C;&#x4F46;&#x4E5F;&#x56E0;&#x6B64;&#x6709;&#x79CD;&#x6E05;&#x98CE;&#x5F90;&#x6765;&#xFF0C;&#x67F3;&#x6697;&#x82B1;&#x660E;&#x53C8;&#x4E00;&#x6751;&#x7684;&#x611F;&#x89C9;&#x3002;&#x8DDF;&#x7740;&#x6559;&#x7A0B;&#x642D;&#x4E86;hexo&#x7684;&#x535A;&#x5BA2;&#x5F00;&#x59CB;&#x8BB0;&#x5F55;&#x65B0;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x5F00;&#x59CB;&#x5728;github&#x4E0A;&#x63D0;&#x4EA4;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5F00;&#x59CB;&#x5B66;&#x4F1A;&#x5206;&#x4EAB;&#xFF0C;&#x8DDF;&#x7740;&#x5E08;&#x5144;&#x5EFA;&#x7ACB;&#x4E86;w3ctrain&#x7684;&#x5E73;&#x53F0;&#x3002;&#x4E5F;&#x6162;&#x6162;&#x7684;&#x53D1;&#x73B0;&#xFF0C;&#x524D;&#x7AEF;&#x7684;&#x53D1;&#x5C55;&#x5F88;&#x5FEB;&#xFF0C;&#x4F46;&#x662F;&#x6240;&#x6709;&#x770B;&#x8D77;&#x6765;&#x9177;&#x70AB;&#x542C;&#x8D77;&#x6765;&#x903C;&#x683C;&#x5F88;&#x9AD8;&#x7684;&#x6846;&#x67B6;&#xFF0C;&#x90FD;&#x662F;&#x522B;&#x4EBA;&#x5C01;&#x88C5;&#x597D;&#x4E86;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x57FA;&#x7840;&#x597D;&#x7684;&#x8BDD;&#x4E0A;&#x624B;&#x4E5F;&#x53EA;&#x662F;&#x82B1;&#x65F6;&#x95F4;&#x53BB;&#x4E86;&#x89E3;&#x8BED;&#x6CD5;&#x601D;&#x60F3;&#x800C;&#x5DF2;&#xFF0C;&#x5E76;&#x4E0D;&#x7528;&#x592A;&#x8FC7;&#x754F;&#x60E7;&#x3002;&#x771F;&#x6B63;&#x9700;&#x8981;&#x5B66;&#x4E60;&#x7684;&#xFF0C;&#x662F;&#x53BB;&#x4E86;&#x89E3;&#x4ED6;&#x4EEC;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8FD9;&#x4E48;&#x5199;&#xFF0C;&#x8FD9;&#x4E48;&#x5199;&#x548C;&#x90A3;&#x6837;&#x5199;&#x6709;&#x4EC0;&#x4E48;&#x5DEE;&#x4E4B;&#x7C7B;&#x4E4B;&#x7C7B;&#x3002;&#x4E00;&#x65B9;&#x9762;&#x56DE;&#x8FC7;&#x5934;&#x5F00;&#x59CB;&#x7FFB;js&#x7EA2;&#x5B9D;&#x4E66;&#x548C;js&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x5F00;&#x59CB;&#x771F;&#x6B63;&#x7684;&#x53BB;&#x4E86;&#x89E3;&#x94FE;&#x5F0F;&#xFF0C;&#x4E86;&#x89E3;&#x5BF9;&#x8C61;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#x5F00;&#x59CB;&#x7814;&#x7A76;css3&#xFF0C;html5&#x7684;&#x4E00;&#x4E9B;&#x65B0;&#x5C5E;&#x6027;&#xFF0C;&#x8DDF;&#x7740;&#x4E00;&#x4E9B;&#x4E3B;&#x6D41;&#x535A;&#x5BA2;&#x7684;&#x811A;&#x6B65;&#x53BB;&#x8BA4;&#x77E5;flex&#x5E03;&#x5C40;&#x53BB;&#x5BF9;&#x505A;&#x7684;&#x9879;&#x76EE;&#x8FDB;&#x884C;&#x6027;&#x80FD;&#x4F18;&#x5316;&#xFF0C;&#x518D;&#x6709;&#x4E00;&#x76F4;&#x8BF4;&#x60F3;&#x5B66;&#x4E60;&#x4E00;&#x95E8;&#x540E;&#x7AEF;&#x8BED;&#x8A00;&#x7684;&#x6211;&#x5F00;&#x59CB;&#x63A5;&#x89E6;&#x4E86;node.js&#xFF0C;&#x6B63;&#x5728;&#x5C1D;&#x8BD5;&#x53BB;&#x5199;&#x70B9;&#x4EC0;&#x4E48;&#x597D;&#x73A9;&#x7684;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x6D41;&#x6C34;&#x8D26;&#x7684;&#x5E9F;&#x8BDD;&#x4E86;&#x90A3;&#x4E48;&#x591A;&#xFF0C;&#x603B;&#x7ED3;&#x4E00;&#x4E0B;&#xFF1A;</p>
<ul>
<li>&#x770B;&#x8FC7;&#x7684;&#x76F8;&#x5173;&#x4E66;&#x7C4D;&#xFF1A;<ul>
<li>&#x300A;css&#x7985;&#x610F;&#x82B1;&#x56ED;&#x300B;</li>
<li>&#x300A;JavaScript DOM&#x7F16;&#x7A0B;&#x827A;&#x672F;&#x300B;</li>
<li>&#x300A;&#x950B;&#x5229;&#x7684;jQuery&#x300B;</li>
<li>&#x300A;&#x56FE;&#x89E3;CSS3:&#x6838;&#x5FC3;&#x6280;&#x672F;&#x4E0E;&#x6848;&#x4F8B;&#x5B9E;&#x6218; &#x300B;</li>
<li>&#x300A;&#x54CD;&#x5E94;&#x5F0F;Web&#x8BBE;&#x8BA1;:HTML5&#x548C;CSS3&#x5B9E;&#x6218;&#x300B;</li>
<li>&#x300A;&#x9AD8;&#x6027;&#x80FD;&#x7F51;&#x7AD9;&#x5EFA;&#x8BBE;&#x6307;&#x5357;&#x300B;</li>
<li>&#x300A;&#x5355;&#x9875;Web&#x5E94;&#x7528;:JavaScript&#x4ECE;&#x524D;&#x7AEF;&#x5230;&#x540E;&#x7AEF; &#x300B; </li>
<li>&#x300A;&#x56FE;&#x89E3;http&#x300B;</li>
<li>&#x300A;web&#x5168;&#x6808;&#x5DE5;&#x7A0B;&#x5E08;&#x7684;&#x81EA;&#x6211;&#x4FEE;&#x517B;&#x300B;</li>
<li>&#x300A;&#x767D;&#x5E3D;&#x5B50;&#x8BB2;Web&#x5B89;&#x5168;&#x300B;</li>
</ul>
</li>
<li>&#x7ECF;&#x5E38;&#x4E0A;&#x7684;&#x7F51;&#x7AD9;&#xFF1A;<ul>
<li><a href="http://www.w3cplus.com/" target="_blank" rel="external">http://www.w3cplus.com/</a></li>
<li><a href="http://www.w3cfuns.com/" target="_blank" rel="external">http://www.w3cfuns.com/</a></li>
<li><a href="https://css-tricks.com/" target="_blank" rel="external">https://css-tricks.com/</a></li>
</ul>
</li>
<li>&#x5173;&#x6CE8;&#x7684;&#x516C;&#x4F17;&#x53F7;&#xFF1A;<ul>
<li>&#x524D;&#x7AEF;&#x65E9;&#x8BFB;&#x8BFE;</li>
<li>&#x524D;&#x7AEF;&#x5927;&#x5168;</li>
</ul>
</li>
</ul>
<p>&#x5927;&#x81F4;&#x8FD9;&#x6837;&#x5427;&#x6709;&#x4E9B;&#x4E5F;&#x4E0D;&#x662F;&#x592A;&#x8BB0;&#x5F97;&#xFF0C;&#x66F4;&#x591A;&#x6574;&#x7406;&#x4E8E;&#xFF1A;<a href="http://collect.w3ctrain.com/" target="_blank" rel="external">http://collect.w3ctrain.com/</a></p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/心得体会/" rel="tag">#心得体会</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/02/23/10-Top-Tips-for-Creating-Cute-Kawaii-Art/" rel="next" title="10个小技巧创造萌系图案">
                <i class="fa fa-chevron-left"></i> 10个小技巧创造萌系图案
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/03/11/Singleton/" rel="prev" title="单例模式">
                单例模式 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/03/05/my-way/"
           data-title="前端之旅" data-url="http://cyseria.xyz/2016/03/05/my-way/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.png"
               alt="鳗鱼鱼" />
          <p class="site-author-name" itemprop="name">鳗鱼鱼</p>
          <p class="site-description motion-element" itemprop="description">这里是自己折腾的各种东西，包括前端技术文章，个人设计作品等，欢迎丢硬币丢香蕉</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">16</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">5</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">19</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/cyseria" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/u/1887935412" target="_blank" title="微博">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  微博
                </a>
              </span>
            
          
        </div>

        
        

        
        
          <div class="links-of-blogroll motion-element links-of-blogroll-inline">
            <div class="links-of-blogroll-title">
              <i class="fa  fa-fw fa-globe"></i>
              Links
            </div>
            <ul class="links-of-blogroll-list">
              
                <li class="links-of-blogroll-item">
                  <a href="http://w3ctrain.com/" title="w3ctrain" target="_blank">w3ctrain</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://manjusaka.itscoder.com/" title="Manjusaka" target="_blank">Manjusaka</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="https://github.com/geeeeeeeeek" title="gayhub过万的奇迹哥" target="_blank">gayhub过万的奇迹哥</a>
                </li>
              
            </ul>
          </div>
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy;  2015 - 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">鳗鱼鱼</span>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"manyuyu"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
    <script src="/vendors/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
    <script src="/js/src/hook-duoshuo.js"></script>
  






  
  

  

  

  

</body>
</html>
