<!doctype html>



  


<html class="theme-next mist use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="心得体会," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="中秋完毕，大厂的秋招也进入白热化的阶段了，几家欢喜几家愁。
每天搬着电脑跑到14楼联调，熬夜做ppt，每天盼着去园区改善伙食，在楼下的河边散步等等，在杭州实习的点滴还历历在目又似梦一场。
一直觉得自己很幸运，能过五关斩六将闯到校招，和一群大神们共事，能结实几个能谈天说地的小伙伴。离职那天，并不知道要以怎样的心情来对待别离，也不知道这一别是不是永别。若无其事的跟跃鸣去办了手续，还了工牌和电脑。和小组">
<meta property="og:type" content="article">
<meta property="og:title" content="找啊找啊找工作">
<meta property="og:url" content="http://cyseria.xyz/2016/09/18/160818-about-work/index.html">
<meta property="og:site_name" content="鳗鱼鱼 | blog">
<meta property="og:description" content="中秋完毕，大厂的秋招也进入白热化的阶段了，几家欢喜几家愁。
每天搬着电脑跑到14楼联调，熬夜做ppt，每天盼着去园区改善伙食，在楼下的河边散步等等，在杭州实习的点滴还历历在目又似梦一场。
一直觉得自己很幸运，能过五关斩六将闯到校招，和一群大神们共事，能结实几个能谈天说地的小伙伴。离职那天，并不知道要以怎样的心情来对待别离，也不知道这一别是不是永别。若无其事的跟跃鸣去办了手续，还了工牌和电脑。和小组">
<meta property="og:updated_time" content="2016-09-18T03:46:03.846Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="找啊找啊找工作">
<meta name="twitter:description" content="中秋完毕，大厂的秋招也进入白热化的阶段了，几家欢喜几家愁。
每天搬着电脑跑到14楼联调，熬夜做ppt，每天盼着去园区改善伙食，在楼下的河边散步等等，在杭州实习的点滴还历历在目又似梦一场。
一直觉得自己很幸运，能过五关斩六将闯到校招，和一群大神们共事，能结实几个能谈天说地的小伙伴。离职那天，并不知道要以怎样的心情来对待别离，也不知道这一别是不是永别。若无其事的跟跃鸣去办了手续，还了工牌和电脑。和小组">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"left","display":"hide"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://cyseria.xyz/2016/09/18/160818-about-work/"/>

  <title> 找啊找啊找工作 | 鳗鱼鱼 | blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">鳗鱼鱼 | blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">鳗鱼鱼的博客</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                找啊找啊找工作
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-09-18T11:41:42+08:00" content="2016-09-18">
              2016-09-18
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/心得体会/" itemprop="url" rel="index">
                    <span itemprop="name">心得体会</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/09/18/160818-about-work/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/09/18/160818-about-work/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p>&#x4E2D;&#x79CB;&#x5B8C;&#x6BD5;&#xFF0C;&#x5927;&#x5382;&#x7684;&#x79CB;&#x62DB;&#x4E5F;&#x8FDB;&#x5165;&#x767D;&#x70ED;&#x5316;&#x7684;&#x9636;&#x6BB5;&#x4E86;&#xFF0C;&#x51E0;&#x5BB6;&#x6B22;&#x559C;&#x51E0;&#x5BB6;&#x6101;&#x3002;</p>
<p>&#x6BCF;&#x5929;&#x642C;&#x7740;&#x7535;&#x8111;&#x8DD1;&#x5230;14&#x697C;&#x8054;&#x8C03;&#xFF0C;&#x71AC;&#x591C;&#x505A;ppt&#xFF0C;&#x6BCF;&#x5929;&#x76FC;&#x7740;&#x53BB;&#x56ED;&#x533A;&#x6539;&#x5584;&#x4F19;&#x98DF;&#xFF0C;&#x5728;&#x697C;&#x4E0B;&#x7684;&#x6CB3;&#x8FB9;&#x6563;&#x6B65;&#x7B49;&#x7B49;&#xFF0C;&#x5728;&#x676D;&#x5DDE;&#x5B9E;&#x4E60;&#x7684;&#x70B9;&#x6EF4;&#x8FD8;&#x5386;&#x5386;&#x5728;&#x76EE;&#x53C8;&#x4F3C;&#x68A6;&#x4E00;&#x573A;&#x3002;</p>
<p>&#x4E00;&#x76F4;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x5F88;&#x5E78;&#x8FD0;&#xFF0C;&#x80FD;&#x8FC7;&#x4E94;&#x5173;&#x65A9;&#x516D;&#x5C06;&#x95EF;&#x5230;&#x6821;&#x62DB;&#xFF0C;&#x548C;&#x4E00;&#x7FA4;&#x5927;&#x795E;&#x4EEC;&#x5171;&#x4E8B;&#xFF0C;&#x80FD;&#x7ED3;&#x5B9E;&#x51E0;&#x4E2A;&#x80FD;&#x8C08;&#x5929;&#x8BF4;&#x5730;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x3002;&#x79BB;&#x804C;&#x90A3;&#x5929;&#xFF0C;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x8981;&#x4EE5;&#x600E;&#x6837;&#x7684;&#x5FC3;&#x60C5;&#x6765;&#x5BF9;&#x5F85;&#x522B;&#x79BB;&#xFF0C;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x4E00;&#x522B;&#x662F;&#x4E0D;&#x662F;&#x6C38;&#x522B;&#x3002;&#x82E5;&#x65E0;&#x5176;&#x4E8B;&#x7684;&#x8DDF;&#x8DC3;&#x9E23;&#x53BB;&#x529E;&#x4E86;&#x624B;&#x7EED;&#xFF0C;&#x8FD8;&#x4E86;&#x5DE5;&#x724C;&#x548C;&#x7535;&#x8111;&#x3002;&#x548C;&#x5C0F;&#x7EC4;&#x53BB;&#x68A6;&#x60F3;&#x5C0F;&#x9547;&#x5403;&#x4E86;&#x4E00;&#x987F;&#x70E4;&#x9C7C;&#xFF0C;&#x5927;&#x65E9;&#x7684;&#x5750;&#x4E0A;&#x4E86;&#x53BB;&#x673A;&#x573A;&#x7684;&#x5927;&#x5DF4;&#xFF0C;&#x5929;&#x7A7A;&#x7070;&#x7070;&#x7684;&#x4E0B;&#x7740;&#x5C0F;&#x96E8;&#xFF0C;&#x6709;&#x70B9;&#x4E0D;&#x820D;&#x6709;&#x70B9;&#x60F3;&#x54ED;&#x3002;</p>
<a id="more"></a>
<p>&#x5F88;&#x591A;&#x4EBA;&#x95EE;&#x6211;&#x79BB;&#x804C;&#x539F;&#x56E0;&#x95EE;&#x6211;&#x4E0B;&#x5BB6;&#x8981;&#x53BB;&#x54EA;&#xFF0C;&#x6211;&#x7684;&#x56DE;&#x7B54;&#x4E5F;&#x4E00;&#x76F4;&#x90FD;&#x662F;&#x518D;&#x770B;&#x3002;&#x8BB0;&#x5F97;&#x8F6C;&#x6B63;&#x7B54;&#x8FA9;&#x4E4B;&#x524D;&#x6240;&#x6709;&#x540C;&#x4E8B;&#x4EE5;&#x53CA;&#x6211;&#x540C;&#x5B66;&#x90FD;&#x5BF9;&#x6211;&#x8BF4;&#x5E94;&#x8BE5;&#x6CA1;&#x95EE;&#x9898;&#xFF0C;&#x7B54;&#x8FA9;&#x4E4B;&#x540E;&#x5E08;&#x5144;&#x4E5F;&#x8BF4;&#x6211;&#x8868;&#x73B0;&#x4E0D;&#x9519;&#x4E0D;&#x7528;&#x6025;&#x7740;&#x627E;&#x522B;&#x7684;&#x3002;&#x7136;&#x800C;&#x5728;hc&#x7D27;&#x5F20;&#xFF0C;&#x8DDF;hr&#x6CA1;&#x6709;&#x5BF9;&#x4E0A;&#x773C;&#x7684;&#x524D;&#x7F6E;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;&#x8C01;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x4E0B;&#x4E00;&#x79D2;&#x662F;&#x5426;&#x62E5;&#x62B1;&#x53D8;&#x5316;&#x3002;</p>
<p>&#x770B;&#x5230;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x5C31;&#x662F;&#xFF0C;&#x5728;&#x5B9E;&#x4E60;&#x8FD9;&#x4E09;&#x4E2A;&#x6708;&#xFF0C;&#x4F60;&#x540E;&#x6094;&#x5417;&#xFF1F;</p>
<p>&#x5F88;&#x8BDA;&#x5B9E;&#x5730;&#x8BF4;&#xFF0C;&#x540E;&#x6094;&#x3002;&#x540E;&#x6094;&#x6BCF;&#x5929;&#x558A;&#x7740;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x6846;&#x67B6;&#x8FD8;&#x662F;&#x8EAB;&#x9677;&#x65E5;&#x590D;&#x4E00;&#x65E5;&#x7684;&#x5DE5;&#x4F5C;&#x4E2D;&#x4EE5;&#x6B64;&#x4E3A;&#x501F;&#x53E3;&#xFF0C;&#x4E00;&#x518D;&#x62D6;&#x6C93;&#xFF1B;&#x66F4;&#x540E;&#x6094;&#x6CA1;&#x6709;&#x5728;&#x4E09;&#x4E2A;&#x6708;&#x7684;&#x65F6;&#x95F4;&#x505A;&#x5230;&#x751F;&#x6D3B;&#x4E0E;&#x5DE5;&#x4F5C;&#x517C;&#x987E;&#xFF0C;&#x6CA1;&#x6709;&#x597D;&#x597D;&#x7684;&#x901B;&#x901B;&#x676D;&#x5DDE;&#x3002;&#x597D;&#x50CF;&#x5927;&#x628A;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x8D44;&#x6E90;&#xFF0C;&#x5C31;&#x8FD9;&#x4E48;&#x88AB;&#x6D6A;&#x8D39;&#x4E86;&#x3002;&#x4EBA;&#x5916;&#x6709;&#x4EBA;&#x5C71;&#x5916;&#x6709;&#x5C71;&#x8FD9;&#x53E5;&#x8BDD;&#xFF0C;&#x7B2C;&#x4E00;&#x6B21;&#x771F;&#x5B9E;&#x800C;&#x6B63;&#x9762;&#x5730;&#x4E86;&#x89E3;&#x3002;</p>
<p>&#x5F53;&#x7136;&#x4E5F;&#x6709;&#x5F88;&#x591A;&#x5F00;&#x5FC3;&#x7684;&#x4E8B;&#x503C;&#x5F97;&#x56DE;&#x5FC6;&#xFF1A;&#x8DDF;&#x820D;&#x53CB;&#x6BCF;&#x4E2A;&#x5468;&#x672B;&#x8DD1;&#x53BB;&#x540C;&#x4E50;&#x4F1A;&#x53BB;&#x897F;&#x57CE;&#x5E7F;&#x573A;&#x6539;&#x5584;&#x4F19;&#x98DF;&#x8FD8;&#x4E92;&#x76F8;&#x8C03;&#x4F83;&#x7EC8;&#x4E8E;&#x8FDB;&#x57CE;&#x3002;&#x8DDF;&#x524D;&#x624B;&#x6DD8;&#x7684;&#x5E08;&#x5144;&#x53BB;&#x4E0A;&#x6D77;&#x53BB;&#x8FEA;&#x58EB;&#x5C3C;&#x5185;&#x6D4B;&#xFF0C;&#x8DDF;&#x963F;&#x91CC;&#x4E91;&#x8DDF;&#x9489;&#x9489;&#x7684;&#x5E08;&#x5144;&#x8BA8;&#x8BBA;&#x5404;&#x4E2A;&#x90E8;&#x95E8;&#x4E4B;&#x95F4;&#x7684;&#x5957;&#x8DEF;&#xFF0C;&#x4EE5;&#x53CA;&#x5E26;&#x7740;p7&#x53BB;&#x770B;&#x54C6;&#x5566;A&#x68A6;&#xFF0C;&#x5728;&#x5BB6;&#x9644;&#x8FD1;&#x7684;&#x7530;&#x57C2;&#x4ECE;&#x5929;&#x4EAE;&#x804A;&#x5230;&#x5929;&#x9ED1;&#x7B49;&#x7B49;&#x3002;&#x8BA4;&#x771F;&#x7684;&#x8BF4;&#xFF0C;&#x963F;&#x91CC;&#x8FD9;&#x4E2A;&#x516C;&#x53F8;&#x5E76;&#x6CA1;&#x6709;&#x592A;&#x5927;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x4E00;&#x95F4;&#x6280;&#x672F;&#x516C;&#x53F8;&#x628A;&#x4EF7;&#x503C;&#x89C2;&#x4EE5;&#x53CA;&#x4E1A;&#x52A1;kpi&#x770B;&#x5F97;&#x592A;&#x91CD;&#xFF0C;&#x820D;&#x4E0D;&#x5F97;&#x7684;&#x662F;&#x90A3;&#x7FA4;&#x4EBA;&#x3002;</p>
<p>&#x4E00;&#x76F4;&#x5BF9;&#x8003;&#x7814;&#x6CA1;&#x4EC0;&#x4E48;&#x5174;&#x8DA3;&#xFF0C;&#x53D7;&#x6C42;&#x804C;&#x98CE;&#x6C14;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x53EA;&#x60F3;&#x627E;&#x4E00;&#x4E2A;&#x8FD8;&#x4E0D;&#x9519;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x505A;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x7684;&#x4E8B;&#x3002;&#x62FF;&#x4E00;&#x4E2A;&#x7814;&#x7A76;&#x751F;&#x548C;&#x4E00;&#x4E2A;&#x540C;&#x671F;&#x6BD5;&#x4E1A;&#x7684;&#x5927;&#x5B66;&#x751F;&#x76F8;&#x6BD4;&#xFF0C;&#x5FC5;&#x7136;&#x662F;&#x65E9;&#x8FDB;&#x5165;&#x793E;&#x4F1A;&#x7684;&#x5927;&#x5B66;&#x751F;&#x7ECF;&#x9A8C;&#x66F4;&#x591A;&#xFF0C;&#x8EAB;&#x4EF7;&#x4E5F;&#x9AD8;&#x4E00;&#x4E9B;&#x3002;&#x8FDB;&#x963F;&#x91CC;&#x4EE5;&#x540E;&#x624D;&#x731B;&#x7136;&#x53D1;&#x73B0;&#xFF0C;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x672C;&#x79D1;&#x751F;&#xFF0C;&#x66F4;&#x4E0D;&#x8981;&#x8BF4;&#x6211;&#x8FD9;&#x4E2A;&#x8FD8;&#x6392;&#x4E0D;&#x4E0A;211&#x7684;&#x672B;&#x7AEF;&#x91CD;&#x672C;&#x3002;</p>
<p>&#x4E5F;&#x4E00;&#x5EA6;&#x60F3;&#x8FC7;&#x662F;&#x5426;&#x56DE;&#x53BB;&#x8003;&#x7814;&#xFF0C;&#x8BA4;&#x771F;&#x76D8;&#x7B97;&#x5982;&#x679C;&#x5DE5;&#x4F5C;&#x4EE5;&#x540E;&#x7EE7;&#x7EED;&#x8FDB;&#x4FEE;&#x5B66;&#x5386;&#x4F1A;&#x662F;&#x4EC0;&#x4E48;&#x6837;&#xFF0C;&#x66F4;&#x4E0D;&#x6B62;&#x4E00;&#x6B21;&#x5730;&#x8003;&#x8651;&#xFF0C;&#x5B66;&#x5386;&#x548C;&#x80FD;&#x529B;&#xFF0C;&#x7A76;&#x7ADF;&#x5B70;&#x5F3A;&#x5B70;&#x5F31;&#x3002;&#x540E;&#x6765;&#x53D1;&#x73B0;&#x8003;&#x8651;&#x518D;&#x591A;&#x4E5F;&#x6CA1;&#x6709;&#x7528;&#xFF0C;&#x53EA;&#x6709;&#x7AED;&#x5C3D;&#x5168;&#x529B;&#x3002;&#x5C31;&#x50CF;&#x73B0;&#x5728;&#xFF0C;&#x610F;&#x8BC6;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x6E3A;&#x5C0F;&#x548C;&#x4E0D;&#x8DB3;&#xFF0C;&#x610F;&#x8BC6;&#x5230;&#x5916;&#x9762;&#x6709;&#x66F4;&#x5E7F;&#x9614;&#x7684;&#x4E16;&#x754C;&#xFF0C;&#x5C31;&#x5E94;&#x8BE5;&#x8001;&#x8001;&#x5B9E;&#x5B9E;&#x4E00;&#x6B65;&#x4E00;&#x6B65;&#x5F80;&#x524D;&#x8FC8;&#x3002;&#x4E8E;&#x6211;&#x800C;&#x8A00;&#xFF0C;&#x77E5;&#x9053;&#x4E86;&#x66F4;&#x7CBE;&#x5F69;&#x7684;&#x4E16;&#x754C;&#xFF0C;&#x77E5;&#x9053;&#x4E86;&#x8FD8;&#x6709;&#x4E00;&#x7FA4;&#x4EBA;&#x5728;&#x707F;&#x70C2;&#x800C;&#x7CBE;&#x5F69;&#x5730;&#x6D3B;&#xFF0C;&#x5C31;&#x6BD4;&#x56FA;&#x5B88;&#x7740;&#x81EA;&#x5DF1;&#x4E00;&#x4EA9;&#x4E09;&#x5206;&#x5730;&#x8981;&#x597D;&#x592A;&#x591A;&#x3002;&#x5C31;&#x50CF;&#x4E00;&#x76F4;&#x5199;&#x5728;QQ&#x7B7E;&#x540D;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#xFF0C;&#x81EA;&#x5DF1;&#x9009;&#x62E9;&#x7684;&#x8DEF;&#x8346;&#x68D8;&#x6EE1;&#x9014;&#x75DB;&#x6B7B;&#x4E5F;&#x4E0D;&#x540E;&#x6094;&#x3002;&#x867D;&#x7136;&#x4E5F;&#x662F;&#x4F1A;&#x6709;&#x5076;&#x5C14;&#x7684;&#x73BB;&#x7483;&#x5FC3;&#x6CDB;&#x6EE5;&#x3002;</p>
<p>&#x627E;&#x5230;&#x5DE5;&#x4F5C;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x8FD9;&#x662F;&#x5F88;&#x4E0D;&#x5BB9;&#x6613;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x65E5;&#x5B50;&#x5F00;&#x59CB;&#x4E00;&#x6210;&#x4E0D;&#x53D8;&#x3002;&#x4E00;&#x76F4;&#x6CA1;&#x505A;&#x8FC7;&#x7814;&#x53D1;&#x5377;&#x7B14;&#x8BD5;&#x7684;&#x6211;&#x5F00;&#x59CB;&#x4E86;&#x5237;&#x9898;&#x4E4B;&#x6162;&#x6162;&#x957F;&#x8DEF;&#x3002;&#x60F3;&#x5230;&#x4E86;&#x9694;&#x58C1;&#x73ED;ios&#x5927;&#x795E;&#x8DDF;&#x6211;&#x8BB2;&#x7684;&#xFF0C;&#x6700;&#x53EF;&#x6015;&#x7684;&#x662F;&#x6CA1;&#x6709;&#x8FDB;&#x6B65;&#xFF0C;&#x628A;&#x4E00;&#x5929;&#x8FC7;&#x4E86;&#x5341;&#x5E74;&#x3002;&#x5B9E;&#x4E60;&#x7684;&#x65F6;&#x5019;&#x6BCF;&#x5468;&#x5199;&#x5468;&#x62A5;&#x5199;&#x601D;&#x8003;&#x603B;&#x7ED3;&#x90FD;&#x8981;&#x96BE;&#x4EA7;&#x3002;&#x7684;&#x786E;&#xFF0C;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;&#x4E0D;&#x96BE;&#xFF0C;&#x4F46;&#x662F;&#x505A;&#x597D;&#x4E00;&#x4EF6;&#x4E8B;&#xFF0C;&#x77E5;&#x9053;&#x4E3A;&#x4EC0;&#x4E48;&#x505A;&#x4EE5;&#x53CA;&#x4EA7;&#x51FA;&#x662F;&#x4EC0;&#x4E48;&#x7684;&#xFF0C;&#x53C8;&#x662F;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x7EA7;&#x522B;&#x3002;</p>
<p>&#x4E4B;&#x524D;&#x8DDF;&#x8C46;&#x8150;&#x5F00;&#x73A9;&#x7B11;&#xFF0C;&#x8BF4;&#x597D;&#x7684;&#x4E00;&#x8D77;&#x53BB;&#x817E;&#x8BAF;&#x7ED3;&#x679C;&#x4E00;&#x4E2A;&#x53BB;&#x4E86;&#x767E;&#x5EA6;&#x4E00;&#x4E2A;&#x53BB;&#x4E86;&#x963F;&#x91CC;&#xFF0C;&#x6BCF;&#x5929;&#x7684;&#x6897;&#x5C31;&#x662F;&#x676D;&#x5DDE;&#x7684;&#x5916;&#x5A46;&#x5BB6;&#x548C;&#x5317;&#x4EAC;&#x7684;&#x8C46;&#x8150;&#x82B1;&#x3002;&#x521A;&#x56DE;&#x6765;&#x7684;&#x65F6;&#x5019;&#x90FD;&#x88AB;&#x820D;&#x53CB;&#x7B11;&#x5947;&#x602A;&#x7684;&#x53E3;&#x97F3;&#xFF0C;&#x751A;&#x81F3;&#x4E00;&#x8D77;&#x53BB;&#x559D;&#x65E9;&#x8336;&#x90FD;&#x5FD8;&#x4E86;&#x6D17;&#x7897;&#x3002;&#x4F3C;&#x4E4E;&#xFF0C;&#x4ECE;&#x4F60;&#x79DF;&#x623F;&#x5B50;&#x5B9E;&#x4E60;&#x7684;&#x90A3;&#x4E00;&#x523B;&#x5F00;&#x59CB;&#xFF0C;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x5C31;&#x671D;&#x7740;&#x65E0;&#x53EF;&#x633D;&#x56DE;&#x7684;&#x8DEF;&#x4E0A;&#x8D70;&#xFF0C;&#x4E00;&#x53EA;&#x811A;&#x8E0F;&#x51FA;&#x4E86;&#x6821;&#x95E8;&#xFF0C;&#x5C31;&#x522B;&#x6307;&#x671B;&#x8F7B;&#x6613;&#x5730;&#x6536;&#x56DE;&#x53BB;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x73B0;&#x5728;&#x53EA;&#x5269;&#x4E0B;&#x82E6;&#x7B11;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x5BD2;&#x51AC;&#xFF0C;&#x6CE1;&#x6CE1;&#x7834;&#x88C2;&#x7684;&#x58F0;&#x97F3;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#x3002;&#x65E5;&#x5B50;&#x5982;&#x6D41;&#x6C34;&#xFF0C;&#x4E00;&#x5929;&#x5929;&#x8FC7;&#x53BB;&#x3002;&#x6EE1;&#x5927;&#x8857;&#x90FD;&#x6CA1;&#x6709;hc&#xFF0C;&#x5E26;&#x7740;&#x820D;&#x53CB;&#x56DE;&#x5BB6;&#x5446;&#x4E86;&#x4E09;&#x5929;&#x804A;&#x4E86;&#x5F88;&#x591A;&#x3002;&#x5766;&#x767D;&#x8BF4;&#x524D;&#x8DEF;&#x5728;&#x54EA;&#x91CC;&#xFF0C;&#x6211;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;&#x3002;&#x53EA;&#x80FD;&#x50CF;&#x8001;&#x5988;&#x8BF4;&#x5F97;&#xFF0C;&#x6709;&#x6CA1;&#x6709;hc&#x662F;&#x522B;&#x4EBA;&#x7684;&#x4E8B;&#xFF0C;&#x6709;&#x6CA1;&#x6709;&#x8BA4;&#x771F;&#x51C6;&#x5907;&#x624D;&#x662F;&#x4F60;&#x81EA;&#x5DF1;&#x8BE5;&#x505A;&#x7684;&#x4E8B;&#x3002;</p>
<p>&#x8FD8;&#x8BB0;&#x5F97;hr&#x5728;&#x6BD5;&#x4E1A;&#x5178;&#x793C;&#x8BF4;&#x7684;&#x4E00;&#x53E5;&#x8BDD;&#xFF1A;&#x805A;&#x662F;&#x4E00;&#x56E2;&#x706B;&#xFF0C;&#x6563;&#x662F;&#x6F2B;&#x5929;&#x7E41;&#x661F;&#x3002;<br>&#x613F;&#x5929;&#x6C14;&#x6674;&#x6717;&#x661F;&#x5149;&#x95EA;&#x70C1;&#x3002;</p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/心得体会/" rel="tag">#心得体会</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/09/10/Note-you-don-t-know-js/" rel="next" title="《你不知道的JavaScript上卷》读书笔记">
                <i class="fa fa-chevron-left"></i> 《你不知道的JavaScript上卷》读书笔记
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/09/18/160818-about-work/"
           data-title="找啊找啊找工作" data-url="http://cyseria.xyz/2016/09/18/160818-about-work/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.png"
               alt="鳗鱼鱼" />
          <p class="site-author-name" itemprop="name">鳗鱼鱼</p>
          <p class="site-description motion-element" itemprop="description">这里是自己折腾的各种东西，包括前端技术文章，个人设计作品等，欢迎丢硬币丢香蕉</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">16</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">4</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">17</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/cyseria" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/u/1887935412" target="_blank" title="微博">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  微博
                </a>
              </span>
            
          
        </div>

        
        

        
        
          <div class="links-of-blogroll motion-element links-of-blogroll-inline">
            <div class="links-of-blogroll-title">
              <i class="fa  fa-fw fa-globe"></i>
              Links
            </div>
            <ul class="links-of-blogroll-list">
              
                <li class="links-of-blogroll-item">
                  <a href="http://w3ctrain.com/" title="w3ctrain" target="_blank">w3ctrain</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://manjusaka.itscoder.com/" title="Manjusaka" target="_blank">Manjusaka</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="https://github.com/geeeeeeeeek" title="gayhub过万的奇迹哥" target="_blank">gayhub过万的奇迹哥</a>
                </li>
              
            </ul>
          </div>
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <p class="post-toc-empty">此文章未包含目录</p>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy;  2015 - 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">鳗鱼鱼</span>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"manyuyu"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
    <script src="/vendors/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
    <script src="/js/src/hook-duoshuo.js"></script>
  






  
  

  

  

  

</body>
</html>
