<!doctype html>



  


<html class="theme-next mist use-motion">
<head>
  <meta charset="UTF-8"/>
<meta http-equiv="X-UA-Compatible" content="IE=edge,chrome=1" />
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1"/>



<meta http-equiv="Cache-Control" content="no-transform" />
<meta http-equiv="Cache-Control" content="no-siteapp" />












  
  
  <link href="/vendors/fancybox/source/jquery.fancybox.css?v=2.1.5" rel="stylesheet" type="text/css" />




  
  
  
  

  
    
    
  

  

  

  

  

  
    
    
    <link href="//fonts.googleapis.com/css?family=Lato:300,300italic,400,400italic,700,700italic&subset=latin,latin-ext" rel="stylesheet" type="text/css">
  






<link href="/vendors/font-awesome/css/font-awesome.min.css?v=4.4.0" rel="stylesheet" type="text/css" />

<link href="/css/main.css?v=5.0.1" rel="stylesheet" type="text/css" />


  <meta name="keywords" content="可爱,设计," />








  <link rel="shortcut icon" type="image/x-icon" href="/favicon.ico?v=5.0.1" />






<meta name="description" content="让我们从萌系风格开始来创造超级可爱的作品！在本文中我将会从配色到形状到不同的设计风格来分别讲解如何创造可爱作品的十个技巧。">
<meta property="og:type" content="article">
<meta property="og:title" content="10个小技巧创造萌系图案">
<meta property="og:url" content="http://cyseria.xyz/2016/02/23/10-Top-Tips-for-Creating-Cute-Kawaii-Art/index.html">
<meta property="og:site_name" content="鳗鱼鱼 | blog">
<meta property="og:description" content="让我们从萌系风格开始来创造超级可爱的作品！在本文中我将会从配色到形状到不同的设计风格来分别讲解如何创造可爱作品的十个技巧。">
<meta property="og:image" content="http://7xpbhk.com1.z0.glb.clouddn.com/00a.jpg">
<meta property="og:image" content="http://7xpbhk.com1.z0.glb.clouddn.com/grean_peas_society_t-shirt_design.jpg">
<meta property="og:image" content="http://7xpbhk.com1.z0.glb.clouddn.com/apple.jpg">
<meta property="og:image" content="http://7xpbhk.com1.z0.glb.clouddn.com/palette1.jpg">
<meta property="og:image" content="http://7xpbhk.com1.z0.glb.clouddn.com/palette2.jpg">
<meta property="og:image" content="http://7xpbhk.com1.z0.glb.clouddn.com/Cute_Sun_in_space-%5BConverted%5D.jpg">
<meta property="og:image" content="http://7xpbhk.com1.z0.glb.clouddn.com/rounded.jpg">
<meta property="og:image" content="http://7xpbhk.com1.z0.glb.clouddn.com/Cute_weather_sticker-%5BConverted%5D.jpg">
<meta property="og:image" content="http://7xpbhk.com1.z0.glb.clouddn.com/Pricklies-AI.jpg">
<meta property="og:image" content="http://7xpbhk.com1.z0.glb.clouddn.com/fruit.jpg">
<meta property="og:image" content="http://7xpbhk.com1.z0.glb.clouddn.com/Chibi%20Cuties.jpg">
<meta property="og:image" content="http://7xpbhk.com1.z0.glb.clouddn.com/Jump-Animal---Vector-Pack.jpg">
<meta property="og:image" content="http://7xpbhk.com1.z0.glb.clouddn.com/Masquerade-%5BConverted%5D.jpg">
<meta property="og:updated_time" content="2016-09-10T03:04:17.074Z">
<meta name="twitter:card" content="summary">
<meta name="twitter:title" content="10个小技巧创造萌系图案">
<meta name="twitter:description" content="让我们从萌系风格开始来创造超级可爱的作品！在本文中我将会从配色到形状到不同的设计风格来分别讲解如何创造可爱作品的十个技巧。">



<script type="text/javascript" id="hexo.configuration">
  var NexT = window.NexT || {};
  var CONFIG = {
    scheme: 'Mist',
    sidebar: {"position":"left","display":"hide"},
    fancybox: true,
    motion: true,
    duoshuo: {
      userId: 0,
      author: '博主'
    }
  };
</script>




  <link rel="canonical" href="http://cyseria.xyz/2016/02/23/10-Top-Tips-for-Creating-Cute-Kawaii-Art/"/>

  <title> 10个小技巧创造萌系图案 | 鳗鱼鱼 | blog </title>
</head>

<body itemscope itemtype="http://schema.org/WebPage" lang="zh-Hans">

  










  
  
    
  

  <div class="container one-collumn sidebar-position-left page-post-detail ">
    <div class="headband"></div>

    <header id="header" class="header" itemscope itemtype="http://schema.org/WPHeader">
      <div class="header-inner"><div class="site-meta ">
  

  <div class="custom-logo-site-title">
    <a href="/"  class="brand" rel="start">
      <span class="logo-line-before"><i></i></span>
      <span class="site-title">鳗鱼鱼 | blog</span>
      <span class="logo-line-after"><i></i></span>
    </a>
  </div>
  <p class="site-subtitle">鳗鱼鱼的博客</p>
</div>

<div class="site-nav-toggle">
  <button>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
    <span class="btn-bar"></span>
  </button>
</div>

<nav class="site-nav">
  

  
    <ul id="menu" class="menu">
      
        
        <li class="menu-item menu-item-home">
          <a href="/" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-home"></i> <br />
            
            首页
          </a>
        </li>
      
        
        <li class="menu-item menu-item-about">
          <a href="/about" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-user"></i> <br />
            
            关于
          </a>
        </li>
      
        
        <li class="menu-item menu-item-archives">
          <a href="/archives" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-archive"></i> <br />
            
            归档
          </a>
        </li>
      
        
        <li class="menu-item menu-item-tags">
          <a href="/tags" rel="section">
            
              <i class="menu-item-icon fa fa-fw fa-tags"></i> <br />
            
            标签
          </a>
        </li>
      

      
    </ul>
  

  
</nav>

 </div>
    </header>

    <main id="main" class="main">
      <div class="main-inner">
        <div class="content-wrap">
          <div id="content" class="content">
            

  <div id="posts" class="posts-expand">
    

  
  

  
  
  

  <article class="post post-type-normal " itemscope itemtype="http://schema.org/Article">

    
      <header class="post-header">

        
        
          <h1 class="post-title" itemprop="name headline">
            
            
              
                10个小技巧创造萌系图案
              
            
          </h1>
        

        <div class="post-meta">
          <span class="post-time">
            <span class="post-meta-item-icon">
              <i class="fa fa-calendar-o"></i>
            </span>
            <span class="post-meta-item-text">发表于</span>
            <time itemprop="dateCreated" datetime="2016-02-23T23:46:51+08:00" content="2016-02-23">
              2016-02-23
            </time>
          </span>

          
            <span class="post-category" >
              &nbsp; | &nbsp;
              <span class="post-meta-item-icon">
                <i class="fa fa-folder-o"></i>
              </span>
              <span class="post-meta-item-text">分类于</span>
              
                <span itemprop="about" itemscope itemtype="https://schema.org/Thing">
                  <a href="/categories/设计相关/" itemprop="url" rel="index">
                    <span itemprop="name">设计相关</span>
                  </a>
                </span>

                
                

              
            </span>
          

          
            
              <span class="post-comments-count">
                &nbsp; | &nbsp;
                <a href="/2016/02/23/10-Top-Tips-for-Creating-Cute-Kawaii-Art/#comments" itemprop="discussionUrl">
                  <span class="post-comments-count ds-thread-count" data-thread-key="2016/02/23/10-Top-Tips-for-Creating-Cute-Kawaii-Art/" itemprop="commentsCount"></span>
                </a>
              </span>
            
          

          

          
          

          
        </div>
      </header>
    


    <div class="post-body" itemprop="articleBody">

      
      

      
        <p><img src="http://7xpbhk.com1.z0.glb.clouddn.com/00a.jpg" alt="enter image description here"><br>&#x8BA9;&#x6211;&#x4EEC;&#x4ECE;&#x840C;&#x7CFB;&#x98CE;&#x683C;&#x5F00;&#x59CB;&#x6765;&#x521B;&#x9020;&#x8D85;&#x7EA7;&#x53EF;&#x7231;&#x7684;&#x4F5C;&#x54C1;&#xFF01;&#x5728;&#x672C;&#x6587;&#x4E2D;&#x6211;&#x5C06;&#x4F1A;&#x4ECE;&#x914D;&#x8272;&#x5230;&#x5F62;&#x72B6;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x8BBE;&#x8BA1;&#x98CE;&#x683C;&#x6765;&#x5206;&#x522B;&#x8BB2;&#x89E3;&#x5982;&#x4F55;&#x521B;&#x9020;&#x53EF;&#x7231;&#x4F5C;&#x54C1;&#x7684;&#x5341;&#x4E2A;&#x6280;&#x5DE7;&#x3002;</p>
<a id="more"></a>
<h2 id="1&#x7B80;&#x7EA6;">1.&#x7B80;&#x7EA6;</h2><p>&#x7B80;&#x2013;&#x8FD9;&#x662F;&#x4F60;&#x51FA;&#x53D1;&#x7684;&#x6700;&#x597D;&#x65B9;&#x5F0F;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x840C;&#x7CFB;&#x98CE;&#x683C;&#x8BBE;&#x8BA1;&#x4E2D;&#x80FD;&#x8BA9;&#x4EBA;&#x611F;&#x89C9;&#x5230;&#x4F60;&#x5728;&#x5356;&#x840C;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x6280;&#x5DE7;&#x3002;&#x538B;&#x5012;&#x6027;&#x7684;&#x7279;&#x5F81;&#x8BBE;&#x8BA1;&#x6216;&#x8005;icon&#x7EC6;&#x8282;&#x80FD;&#x8BA9;&#x4E00;&#x4E9B;&#x53EF;&#x7231;&#x7684;&#x4E1C;&#x897F;&#x53D8;&#x5F97;&#x6BDB;&#x9AA8;&#x609A;&#x7136;&#x3002;&#x592A;&#x591A;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x6216;&#x8005;&#x5927;&#x9762;&#x79EF;&#x73B0;&#x5B9E;&#x4E3B;&#x4E49;&#x51B2;&#x51FB;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x8BA9;&#x4F5C;&#x54C1;&#x53D8;&#x5F97;&#x53EF;&#x6015;&#x800C;&#x4E0D;&#x662F;&#x53EF;&#x7231;&#x548C;&#x53D7;&#x6B22;&#x8FCE;&#x3002;<br><img src="http://7xpbhk.com1.z0.glb.clouddn.com/grean_peas_society_t-shirt_design.jpg" alt="Green Peas Society - T-shirt"><br><em><a href="http://graphicriver.net/item/green-peas-society-tshirt/5688757" target="_blank" rel="external">Green Peas Society - T-shirt</a></em><br>&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x4E0A;&#x9762;&#x7684;&#x63D2;&#x56FE;&#xFF0C;&#x5B83;&#x5F88;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x4E5F;&#x5F88;&#x840C;&#x3002;&#x8C4C;&#x8C46;&#x7684;&#x8138;&#x662F;&#x4EC5;&#x4EC5;&#x662F;&#x7B80;&#x5355;&#x7684;&#x70B9;&#x548C;&#x66F2;&#x7EBF;&#x7EC4;&#x6210;&#x3002;&#x6CE8;&#x610F;&#x5982;&#x4F55;&#x7701;&#x7565;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x4F8B;&#x5982;&#x4E0A;&#x56FE;&#x7684;&#x9F3B;&#x5B50;&#x8033;&#x6735;&#x4EE5;&#x53CA;&#x773C;&#x775B;&#x7684;&#x7EC6;&#x8282;&#x5BF9;&#x4E8E;&#x7B80;&#x5355;&#x53EF;&#x7231;&#x7684;&#x8BBE;&#x8BA1;&#x5C31;&#x53EF;&#x4EE5;&#x820D;&#x53BB;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x50CF;&#x8138;&#x988A;&#x7684;&#x7EA2;&#x8272;&#x70B9;&#x7F00;&#x53C8;&#x4F1A;&#x8BA9;&#x4F60;&#x7684;&#x4F5C;&#x54C1;&#x66F4;&#x53D7;&#x6B22;&#x8FCE;&#xFF0C;&#x4E0D;&#x8FC7;&#x65E0;&#x8BBA;&#x4EFB;&#x4F55;&#x65B9;&#x5F0F;&#x90FD;&#x4E0D;&#x80FD;&#x8FC7;&#x5EA6;&#x3002;<br>&#x6B64;&#x5916;&#xFF0C;&#x6CE8;&#x610F;&#x6241;&#x5E73;&#x7684;&#x8BBE;&#x8BA1;&#x3002;&#x6241;&#x5E73;&#x5316;&#x989C;&#x8272;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x7EBF;&#x6761;&#xFF0C;&#x518D;&#x52A0;&#x5C11;&#x8BB8;&#x4E2A;&#x6027;&#x5316;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x8FD9;&#x79CD;&#x7B80;&#x7EA6;&#x662F;&#x6240;&#x6709;&#x4E1C;&#x897F;&#x90FD;&#x9700;&#x8981;&#x6709;&#x7684;&#x4F46;&#x662F;&#x4E00;&#x70B9;&#x5C31;&#x591F;&#x4E86;&#x3002;<br><img src="http://7xpbhk.com1.z0.glb.clouddn.com/apple.jpg" alt="how to cute"><br><em>How to Cute</em><br>&#x90A3;&#x4E48;&#x840C;&#x840C;&#x7684;&#x4F5C;&#x54C1;&#x662F;&#x600E;&#x4E48;&#x521B;&#x4F5C;&#x51FA;&#x6765;&#x7684;&#x5462;&#xFF1F;&#x4EE5;&#x4E0A;&#x662F;&#x6765;&#x81EA;<a href="http://howtocuteblog.tumblr.com/" target="_blank" rel="external">how to cute</a>(&#x9700;&#x8981;&#x68AF;&#x5B50;)&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8BE5;&#x535A;&#x5BA2;&#x81F4;&#x529B;&#x4E8E;&#x8BF4;&#x660E;&#x7B80;&#x5355;&#x7684;&#x5F62;&#x72B6;&#x6216;&#x7269;&#x4F53;&#x662F;&#x600E;&#x4E48;&#x7EC4;&#x5408;&#x53D8;&#x5F97;&#x53EF;&#x7231;&#x7684;&#x3002;</p>
<h2 id="2&#x901A;&#x8FC7;&#x914D;&#x8272;&#x6765;&#x8BA9;&#x4F5C;&#x54C1;&#x53D8;&#x5F97;&#x53EF;&#x7231;">2.&#x901A;&#x8FC7;&#x914D;&#x8272;&#x6765;&#x8BA9;&#x4F5C;&#x54C1;&#x53D8;&#x5F97;&#x53EF;&#x7231;</h2><p>&#x6240;&#x6709;&#x989C;&#x8272;&#x90FD;&#x662F;&#x827A;&#x672F;&#x7684;&#x6709;&#x6548;&#x8868;&#x8FBE;&#x5F62;&#x5F0F;&#xFF0C;&#x6709;&#x4E00;&#x4E9B;&#x989C;&#x8272;&#x5C31;&#x662F;&#x957F;&#x5F97;&#x6BD4;&#x522B;&#x7684;&#x53EF;&#x7231;&#x3002;&#x5927;&#x591A;&#x840C;&#x840C;&#x7684;&#x4F5C;&#x54C1;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x7EAF;&#x771F;&#x7684;&#x6C14;&#x606F;&#xFF0C;&#x5E76;&#x4E14;&#x4E0E;&#x5B69;&#x7AE5;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x5A92;&#x4F53;&#x6709;&#x5F88;&#x591A;&#x5171;&#x540C;&#x4E4B;&#x5904;&#x3002;<br>&#x5F53;&#x7136;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x8BF4;&#xFF0C;&#x53EF;&#x7231;&#x7684;&#x98CE;&#x683C;&#x8BBE;&#x8BA1;&#x4EC5;&#x4EC5;&#x662F;&#x9488;&#x5BF9;&#x513F;&#x7AE5;&#x6216;&#x8005;&#x9762;&#x5411;&#x513F;&#x7AE5;&#xFF0C;&#x800C;&#x662F;&#x8981;&#x8BF4;&#x660E;&#x4E0D;&#x540C;&#x7684;&#x8272;&#x5F69;&#x4F1A;&#x8868;&#x8FBE;&#x4E0D;&#x540C;&#x7684;&#x60C5;&#x611F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6536;&#x96C6;&#x5E38;&#x89C1;&#x7684;&#x989C;&#x8272;&#x8BA9;&#x8BBE;&#x8BA1;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x987A;&#x624B;&#x3002;<br><img src="http://7xpbhk.com1.z0.glb.clouddn.com/palette1.jpg" alt="Rainbows, brights, and pastels"><br>&#x591A;&#x5F69;&#xFF0C;&#x4EAE;&#x8272;&#x548C;&#x7C89;&#x5F69;&#x5728;&#x840C;&#x840C;&#x7684;&#x4F5C;&#x54C1;&#x4E2D;&#x5C24;&#x4E3A;&#x5E38;&#x89C1;&#x3002;&#x4EAE;&#x8272;&#x5728;&#x5404;&#x79CD;&#x573A;&#x5408;&#x90FD;&#x9002;&#x7528;&#xFF1A;&#x53EF;&#x7231;&#x7684;&#x6C34;&#x679C;&#x548C;&#x7CD6;&#x679C;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x7269;&#x4F53;&#xFF0C;&#x5145;&#x6EE1;&#x7F8E;&#x5473;&#x7684;&#x573A;&#x666F;&#xFF0C;&#x53EF;&#x7231;&#x7684;&#x4EBA;&#x7269;&#x7B49;&#x7B49;&#x3002;&#x901A;&#x5E38;&#x827A;&#x672F;&#x672C;&#x8EAB;&#x662F;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x5145;&#x6EE1;&#x6D3B;&#x529B;&#x7684;&#x989C;&#x8272;&#x53EF;&#x4EE5;&#x5F15;&#x4EBA;&#x6CE8;&#x76EE;&#xFF0C;&#x4F7F;&#x7528;&#x4E30;&#x5BCC;&#x7684;&#x4EAE;&#x8272;&#x8BBE;&#x8BA1;&#x53EF;&#x4EE5;&#x4F7F;&#x53EF;&#x7231;&#x7684;&#x4F5C;&#x54C1;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x53EF;&#x7231;&#x3002;<br>&#x7C89;&#x5F69;&#x8272;&#xFF08;pastels&#xFF09;&#x5219;&#x66F4;&#x52A0;&#x67D4;&#x548C;&#x751C;&#x7F8E;&#xFF0C;&#x5C31;&#x50CF;&#x5F88;&#x591A;&#x5361;&#x54C7;&#x4F0A;&#x7684;&#x89D2;&#x8272;&#x8BBE;&#x8BA1;&#x3002;&#x60F3;&#x60F3;&#x5C0F;&#x5154;&#x5B50;&#xFF0C;&#x68C9;&#x82B1;&#x6602;&#x6216;&#x8005;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x7CD6;&#x679C;&#x3002;&#x63A5;&#x7740;&#x4F60;&#x53EF;&#x4EE5;&#x7ED9;&#x4F60;&#x7684;&#x914D;&#x8272;&#x7248;&#x9009;&#x4E00;&#x4E2A;&#x67D4;&#x548C;&#x7684;&#x8272;&#x5F69;&#xFF0C;&#x4F60;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x5728;&#x5B9E;&#x9645;&#x8BBE;&#x8BA1;&#x4E2D;&#x771F;&#x7684;&#x5E94;&#x7528;&#x5F69;&#x8679;&#x6765;&#x8BA9;&#x4ED6;&#x4FDD;&#x6301;&#x53EF;&#x7231;&#x98CE;&#x683C;&#x3002;<br>&#x6709;&#x4E00;&#x5B9A;&#x8C03;&#x8272;&#x677F;&#x5C31;&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x5DE5;&#x4F5C;&#x4E86;&#x3002;&#x5F53;&#x4F60;&#x60F3;&#x9650;&#x5236;&#x67D0;&#x4E8B;&#x7269;&#x7684;&#x65F6;&#x5019;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x8C03;&#x8272;&#x677F;&#x4E2D;&#x4E24;&#x79CD;&#xFF0C;&#x4E09;&#x79CD;&#x6216;&#x8005;&#x56DB;&#x79CD;&#x989C;&#x8272;&#x3002;&#x901A;&#x5E38;&#x8FD9;&#x5E94;&#x7528;&#x5728;&#x8981;&#x5370;&#x5237;&#x53EF;&#x7231;&#x4EBA;&#x7269;&#x6216;&#x827A;&#x672F;&#x753B;&#x7684;&#x4EA7;&#x54C1;&#x4E0A;&#xFF0C;&#x4F46;&#x5B83;&#x4E5F;&#x80FD;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x6709;&#x8DA3;&#x7684;&#x8BBE;&#x8BA1;&#x6311;&#x6218;&#x3002;&#x770B;&#x770B;&#x4E0B;&#x9762;&#x4E00;&#x4E9B;&#x53EF;&#x7231;&#x7684;&#x6709;&#x9650;&#x7684;&#x8C03;&#x8272;&#x677F;<br><img src="http://7xpbhk.com1.z0.glb.clouddn.com/palette2.jpg" alt="Three examples of cute limited color palettes."><br><em>Three examples of cute limited color palettes.</em></p>
<h2 id="3&#x8F6F;&#x6E10;&#x53D8;&#x548C;&#x6241;&#x5E73;&#x8272;">3.&#x8F6F;&#x6E10;&#x53D8;&#x548C;&#x6241;&#x5E73;&#x8272;</h2><p>&#x5F53;&#x8C08;&#x5230;&#x840C;&#x7CFB;&#x8BBE;&#x8BA1;&#x65F6;&#xFF0C;&#x5B83;&#x5E94;&#x8BE5;&#x5EFA;&#x7ACB;&#x5728;&#x7B80;&#x7EA6;&#x98CE;&#x683C;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x800C;&#x6241;&#x5E73;&#x7684;&#x8272;&#x5F69;&#x4E5F;&#x662F;&#x5728;&#x8FD9;&#x79CD;&#x8BBE;&#x8BA1;&#x4E2D;&#x975E;&#x5E38;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x3002;&#x5F53;&#x4F60;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x52FE;&#x51FA;&#x8F6E;&#x5ED3;&#x548C;&#x4F7F;&#x7528;&#x6241;&#x5E73;&#x8272;&#x5F69;&#x6216;&#x8005;&#x6DFB;&#x52A0;&#x4E00;&#x4E9B;&#x9634;&#x5F71;&#x6765;&#x589E;&#x52A0;&#x4F5C;&#x54C1;&#x7684;&#x7ACB;&#x4F53;&#x611F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x5C31;&#x4E0D;&#x9700;&#x8981;&#x82B1;&#x592A;&#x5927;&#x529F;&#x592B;&#x6765;&#x5236;&#x4F5C;&#x4F5C;&#x54C1;&#x4E86;&#x3002;</p>
<p><img src="http://7xpbhk.com1.z0.glb.clouddn.com/Cute_Sun_in_space-%5BConverted%5D.jpg" alt="Sun in Space"><br>&#x5982;&#x679C;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x989C;&#x8272;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x4F20;&#x7EDF;&#x7684;&#x8FD8;&#x662F;&#x6570;&#x5B57;&#x5316;&#x5DE5;&#x4F5C;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x8003;&#x8651;&#x8F6F;&#x6E10;&#x53D8;&#x3002;&#x50CF;&#x8FD9;&#x53EF;&#x7231;&#x7684;&#x592A;&#x9633;&#x7684;&#x5149;&#x8F89;&#xFF0C;&#x8FD9;&#x662F;&#x4E3A;&#x4FDD;&#x6301;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x6307;&#x5357;&#x827A;&#x672F;&#x54C1;&#x53EF;&#x7231;&#x800C;&#x589E;&#x52A0;&#x4E00;&#x4E9B;&#x989D;&#x5916;&#x7684;&#x7EC6;&#x8282;&#x3002;&#x8F6F;&#x6E10;&#x53D8;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x538B;&#x5012;&#x8BBE;&#x8BA1;&#x548C;&#x5C06;&#x5176;&#x4FDD;&#x6301;&#x53EF;&#x7231;&#x53CB;&#x597D;&#x4E14;&#x4E0D;&#x7528;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x523A;&#x773C;&#x7684;&#x5149;&#x6E90;&#x6216;&#x4F7F;&#x8BBE;&#x8BA1;&#x8FC7;&#x4E8E;&#x73B0;&#x5B9E;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x53EF;&#x4EE5;&#x5FFD;&#x7565;&#x8FD9;&#x4E9B;&#x201C;&#x89C4;&#x5219;&#x201D;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x60F3;&#x6CD5;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x5F00;&#x59CB;&#x63A2;&#x7D22;&#x840C;&#x7CFB;&#x8BBE;&#x8BA1;&#x7684;&#x5FAE;&#x5C0F;&#x53D8;&#x5316;&#xFF0C;&#x4E0D;&#x4F1A;&#x8BA9;&#x4ED6;&#x4EA7;&#x751F;&#x592A;&#x591A;&#x6742;&#x7269;&#x3002;</p>
<h2 id="4&#x5706;&#x5F62;&#x548C;&#x8FB9;&#x89D2;">4.&#x5706;&#x5F62;&#x548C;&#x8FB9;&#x89D2;</h2><p>&#x4F60;&#x4F1A;&#x6CE8;&#x610F;&#x5230;&#x7684;&#x53E6;&#x4E00;&#x4EF6;&#x4E8B;&#x5927;&#x591A;&#x4F60;&#x770B;&#x5230;&#x7684;&#x840C;&#x7CFB;&#x8BBE;&#x8BA1;&#x90FD;&#x662F;&#x6CA1;&#x6709;&#x9510;&#x5229;&#x8FB9;&#x89D2;&#x7684;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x840C;&#x7CFB;&#x8BBE;&#x8BA1;&#x4E3A;&#x4E86;&#x513F;&#x7AE5;&#x6216;&#x5E74;&#x8F7B;&#x4EBA;&#xFF1A;&#x53EF;&#x7231;&#x7684;&#x4E1C;&#x897F;&#x901A;&#x5E38;&#x662F;&#x5706;&#x5F62;&#x7684;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7ED9;&#x8BA9;&#x4F60;&#x7684;&#x4F5C;&#x54C1;&#x53D8;&#x5F97;&#x67D4;&#x548C;&#xFF0C;&#x9017;&#x4EBA;&#x559C;&#x7231;&#x3002;</p>
<p><img src="http://7xpbhk.com1.z0.glb.clouddn.com/rounded.jpg" alt="enter image description here"></p>
<p>&#x5706;&#x89D2;&#x662F;&#x53CB;&#x597D;&#x7684;&#xFF0C; &#x5B83;&#x8BA9;&#x5F53;&#x4E00;&#x4E2A;&#x5361;&#x901A;&#x690D;&#x7269;&#x7684;&#x8138;&#x4E0A;&#x6709;&#x5DE8;&#x5927;&#x7684;&#x95EA;&#x4EAE;&#x7684;&#x773C;&#x775B;&#x7684;&#x65F6;&#x5019;&#x663E;&#x5F97;&#x4E0D;&#x90A3;&#x4E48;&#x53EF;&#x6015;&#x3002;&#x6709;&#x7A81;&#x5140;&#x7684;&#x5C16;&#x523A;&#x7684;&#x690D;&#x7269;&#x5BF9;&#x6BD4;&#x8D77;&#x90A3;&#x79CD;&#x5706;&#x89D2;&#x7684;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x8BA9;&#x72D7;&#x6495;&#x54AC;&#x8D77;&#x6765;&#x4F1A;&#x5431;&#x5431;&#x53EB;&#x73A9;&#x5177;&#x66F4;&#x52A0;&#x5177;&#x6709;&#x6740;&#x4F24;&#x529B;&#x3002;</p>
<p>&#x5C06;&#x89C9;&#x5F97;&#x53EF;&#x6015;&#x7684;&#x7269;&#x4F53;&#x8F6C;&#x6362;&#x6210;&#x5A74;&#x513F;&#x623F;&#x95F4;&#x7684;&#x6837;&#x5B50;&#xFF1A;&#x7528;&#x5706;&#x89D2;&#x4FDD;&#x62A4;&#x53BB;&#x66FF;&#x4EE3;&#x9510;&#x5229;&#x7684;&#x8FB9;&#x7F18;&#x3002;&#x81F3;&#x4E8E;&#x662F;&#x4E00;&#x70B9;&#x70B9;&#x5706;&#x89D2;&#x8FD8;&#x662F;&#x66F4;&#x591A;&#xFF0C;&#x8FD9;&#x5C31;&#x53D6;&#x51B3;&#x4E8E;&#x8BBE;&#x8BA1;&#x7684;&#x7C7B;&#x578B;&#x548C;&#x4E2A;&#x4EBA;&#x7231;&#x597D;&#x4E86;&#x3002;</p>
<h2 id="5&#x753B;&#x4E00;&#x5F20;&#x8138;">5.&#x753B;&#x4E00;&#x5F20;&#x8138;</h2><p>&#x8138;&#x988A;&#x2014;&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x5728;&#x840C;&#x7CFB;&#x8BBE;&#x8BA1;&#x4E2D;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x3002;&#x4ECE;&#x8336;&#x676F;&#x5230;&#x96EA;&#x82B1;&#xFF0C;&#x6240;&#x6709;&#x7269;&#x4F53;&#x90FD;&#x6709;&#x8138;&#x3002;&#x5728;&#x5370;&#x5237;&#x827A;&#x672F;&#x54C1;&#x7B49;&#x5404;&#x79CD;&#x5404;&#x6837;&#x7684;&#x7EDF;&#x8BA1;&#x4E2D;&#xFF0C;&#x4EBA;&#x5F62;&#x5316;&#x7269;&#x4F53;&#x5E94;&#x8BE5;&#x662F;&#x53EF;&#x7231;&#x548C;&#x6709;&#x8DA3;&#x7684;&#x3002;<br>&#x65E0;&#x8BBA;&#x4F60;&#x662F;&#x521B;&#x5EFA;&#x8D34;&#x7EB8;&#x6216;&#x56FE;&#x6807;&#x3001;&#x7EBA;&#x7EC7;&#x5370;&#x5237;&#x6216;&#x5305;&#x88C5;&#x8BBE;&#x8BA1;&#x3001;&#x73A9;&#x5177;&#x6216;&#x6E38;&#x620F;&#xFF0C;&#x7ED9;&#x4F60;&#x7684;&#x4F5C;&#x54C1;&#x52A0;&#x4E00;&#x4E2A;&#x8138;&#x988A;&#x662F;&#x5C06;&#x6B63;&#x5E38;&#x7684;&#x4E1C;&#x897F;&#x53D8;&#x6210;&#x8BFE;&#x53EF;&#x7231;&#x7684;&#x7269;&#x4F53;&#x4E00;&#x4E2A;&#x786E;&#x5207;&#x6761;&#x4EF6;&#x3002;&#x6709;&#x7591;&#x95EE;&#x65F6;&#xFF0C;&#x753B;&#x4E2A;&#x8138;&#xFF01;&#x5C31;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#x3002;<br><img src="http://7xpbhk.com1.z0.glb.clouddn.com/Cute_weather_sticker-%5BConverted%5D.jpg" alt="Weather Stickers"></p>
<h2 id="6&#x5236;&#x9020;&#x60C5;&#x611F;">6.&#x5236;&#x9020;&#x60C5;&#x611F;</h2><p>&#x73B0;&#x5728;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x9762;&#x5BF9;&#x6240;&#x6709;&#x4E00;&#x5207;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x5E0C;&#x671B;&#x591A;&#x753B;&#x4E00;&#x5806;&#x5FAE;&#x7B11;&#x6216;&#x8005;&#x4F60;&#x5DF2;&#x7ECF;&#x5728;&#x521B;&#x9020;&#x4E00;&#x4E9B;&#x53EF;&#x7231;&#x7684;&#x5B57;&#x7B26;&#x4E86;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x7684;&#x60C5;&#x611F;&#x5236;&#x4F5C;&#x548C;&#x7ED9;&#x4E88;&#x5C0F;&#x89D2;&#x8272;&#x7684;&#x8868;&#x60C5;&#xFF0C;&#x4F8B;&#x5982;&#x3002;<br><img src="http://7xpbhk.com1.z0.glb.clouddn.com/Pricklies-AI.jpg" alt="Pricklies"><br>&#x89C1;&#x4E0A;&#x56FE;&#x3002;&#x9AD8;&#x5174;&#xFF0C;&#x751F;&#x6C14;&#xFF0C;&#x60B2;&#x4F24;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x90FD;&#x662F;&#x7528;&#x7B80;&#x5355;&#x7684;&#x5F62;&#x72B6;&#x548C;&#x4E00;&#x5B9A;&#x7684;&#x7EC6;&#x8282;&#x6765;&#x8868;&#x793A;&#x3002;&#x4FA7;&#x5411;&#x7684;V&#x8BA9;&#x773C;&#x775B;&#x95ED;&#x4E0A;&#x4EE3;&#x8868;&#x7728;&#x773C;&#x3002;&#x5982;&#x4F55;&#x8868;&#x8FBE;&#x751F;&#x6C14;&#x6216;&#x6124;&#x6012;&#x7684;&#x8868;&#x60C5;&#x5462;&#xFF1F;&#x7B80;&#x5355;&#x7684;&#x6539;&#x53D8;&#x4E00;&#x4E0B;&#x989C;&#x8272;&#x5C31;&#x597D;&#x4E86;&#x3002;&#x660F;&#x660F;&#x6B32;&#x7761;&#x6216;&#x653E;&#x677E;&#x7684;&#x8868;&#x60C5;&#x5462;&#xFF1F;&#x770B;&#x770B;&#x8FD9;&#x4E2A;&#x534A;&#x95ED;&#x534A;&#x7741;&#x7684;&#x773C;&#x775B;&#x3002;<br>&#x5728;&#x955C;&#x5B50;&#x9762;&#x524D;&#x505A;&#x9B3C;&#x8138;&#xFF0C;&#x89C2;&#x5BDF;&#x4E00;&#x4E9B;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x4FE1;&#x606F;&#x7684;&#x7EBF;&#x6761;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x4F60;&#x505A;&#x7684;&#x4E0D;&#x540C;&#x9762;&#x5B54;&#x6DFB;&#x52A0;&#x5230;&#x6240;&#x6709;&#x4F60;&#x4F5C;&#x54C1;&#x4E2D;&#x3002;</p>
<h2 id="7&#x98DF;&#x7269;">7.&#x98DF;&#x7269;</h2><p>&#x6B63;&#x5982;&#x6211;&#x4E0A;&#x9762;&#x63D0;&#x5230;&#x7684;&#x5404;&#x79CD;&#x9879;&#x76EE;&#xFF0C;&#x98DF;&#x54C1;&#x5728;&#x840C;&#x7CFB;&#x8BBE;&#x8BA1;&#x4E2D;&#x662F;&#x53EF;&#x4EE5;&#x7ECF;&#x5E38;&#x88AB;&#x89C1;&#x5230;&#x7684;&#x3002;&#x4E5F;&#x8BB8;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7269;&#x79CD;&#x9700;&#x8981;&#x751F;&#x5B58;&#x3002;&#x4E5F;&#x8BB8;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x4E1C;&#x897F;&#x51E0;&#x4E4E;&#x65E0;&#x5904;&#x4E0D;&#x5728;&#x3002;&#x4E5F;&#x8BB8;&#x662F;&#x56E0;&#x4E3A;&#x79D8;&#x5BC6;&#x98DF;&#x7269;&#x662F;&#x4F60;&#x7684;&#x670B;&#x53CB;&#x3002;<br>&#x65E0;&#x8BBA;&#x771F;&#x6B63;&#x7684;&#x539F;&#x56E0;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x98DF;&#x54C1;&#x5728;&#x840C;&#x7CFB;&#x8BBE;&#x8BA1;&#x4E2D;&#x7684;&#x5E94;&#x7528;&#x5DF2;&#x7ECF;&#x6210;&#x719F;&#x3002;&#x62E5;&#x6709;&#x6216;&#x4EAE;&#x6216;&#x67D4;&#x7684;&#x989C;&#x8272;&#xFF0C;&#x5DF4;&#x638C;&#x8138;&#x7684;&#x6C34;&#x679C;&#x3001;&#x7CD6;&#x679C;&#x3001;&#x852C;&#x83DC;&#x548C;&#x7F8E;&#x5473;&#x7684;&#x7CD6;&#x679C;&#x7B49;&#x5DF2;&#x7ECF;&#x51C6;&#x5907;&#x597D;&#x4E86;&#x8BA9;&#x4F60;&#x53BB;&#x63CF;&#x7ED8;&#xFF0C;&#x8BA9;&#x4F60;&#x5C06;&#x5B83;&#x4EEC;&#x6DFB;&#x52A0;&#x5230;&#x60A8;&#x7684;&#x8BBE;&#x8BA1;&#x3002;<br><img src="http://7xpbhk.com1.z0.glb.clouddn.com/fruit.jpg" alt="Fruit Character Creation Kit"></p>
<h2 id="8&#x5927;&#x5934;&#x5C0F;&#x8EAB;&#x4F53;">8.&#x5927;&#x5934;&#x5C0F;&#x8EAB;&#x4F53;</h2><p>&#x6211;&#x4EEC;&#x8C08;&#x4E86;&#x5173;&#x4E8E;&#x5F88;&#x591A;&#x52A8;&#x7269;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x4F46;&#x662F;&#x4EBA;&#x6216;&#x4EBA;&#x5F62;&#x89D2;&#x8272;&#x5462;&#xFF1F;&#x6B63;&#x5E38;&#x7684;&#x4EBA;&#x7C7B;&#x7684;&#x6BD4;&#x4F8B;&#x53EF;&#x4EE5;&#x53EF;&#x7231;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x4E0D;&#x662F;&#x771F;&#x6B63;&#x7684;&#x201C;&#x840C;&#x201D;&#x3002;&#x4F60;&#x5FC5;&#x987B;&#x8D70;&#x5F97;&#x66F4;&#x8FDC;&#xFF0C;&#x901A;&#x5E38;&#x5361;&#x901A;&#x8BBE;&#x8BA1;&#x7684;&#x6BD4;&#x4F8B;&#x90FD;&#x662F;&#x626D;&#x66F2;&#x7684;&#x7136;&#x800C;&#x6211;&#x4EEC;&#x4E5F;&#x4F1A;&#x89C9;&#x5F97;&#x8FD9;&#x5F88;&#x840C;&#x3002;&#x5DE8;&#x5927;&#x7684;&#x8111;&#x888B;&#xFF0C;&#x7ECF;&#x5E38;&#x5927;&#x773C;&#x775B;&#xFF0C;&#x5F88;&#x5C0F;&#x7684;&#x8EAB;&#x4F53;&#x3002;<br>&#x5728;&#x4E00;&#x4E2A;&#x5C0F;&#x5C0F;&#x7684;&#x8EAB;&#x4F53;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x592A;&#x591A;&#x7684;&#x7A7A;&#x95F4;&#x53BB;&#x63CF;&#x7ED8;&#x7EC6;&#x8282;&#xFF0C;&#x4F46;&#x4E5F;&#x4E0D;&#x662F;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x3002;&#x770B;&#x770B;&#x4E0B;&#x9762;&#x7684;&#x5C0F;&#x89D2;&#x8272;&#xFF0C;&#x5728;&#x4ED6;&#x7684;&#x8863;&#x670D;&#x4E0A;&#x6709;&#x8170;&#x5E26;&#x5C0F;&#x9886;&#x5B50;&#x4E0D;&#x540C;&#x7684;&#x56FE;&#x6848;&#x7B49;&#x7EC6;&#x8282;&#x3002;<br><img src="http://7xpbhk.com1.z0.glb.clouddn.com/Chibi%20Cuties.jpg" alt="enter image description here"><br>&#x4E00;&#x4E9B;&#x6709;&#x7279;&#x8272;&#x7684;&#x7EC6;&#x8282;&#x53EF;&#x4EE5;&#x52A0;&#x5230;&#x4EBA;&#x7269;&#x7684;&#x8863;&#x670D;&#x4E0A;&#xFF0C;&#x4F46;&#x60F3;&#x8981;&#x5C55;&#x793A;&#x6298;&#x53E0;&#x3001;&#x7F1D;&#x5408;&#xFF0C;&#x900F;&#x89C6;&#x7B49;&#x73B0;&#x5B9E;&#x670D;&#x88C5;&#x62E5;&#x6709;&#x7684;&#xFF0C;&#x5C06;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x53EF;&#x80FD;&#x5B8C;&#x6210;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x5C06;&#x91CD;&#x70B9;&#x653E;&#x5728;&#x5934;&#xFF0C;&#x5934;&#x53D1;&#x548C;&#x8138;&#x4E0A;&#x3002;<br>&#x5934;&#x592A;&#x5927;&#x4F1A;&#x4F7F;&#x8116;&#x5B50;&#x627F;&#x53D7;&#x4E0D;&#x4F4F;&#x7684;&#x8FD9;&#x79CD;&#x4E07;&#x6709;&#x5F15;&#x529B;&#x5B9A;&#x5F8B;&#x5728;&#x840C;&#x7CFB;&#x8BBE;&#x8BA1;&#x4E2D;&#x662F;&#x53EF;&#x4EE5;&#x88AB;&#x5FFD;&#x7565;&#x7684;&#x3002;&#x5728;&#x840C;&#x7CFB;&#x8BBE;&#x8BA1;&#x4E2D;&#xFF0C;&#x5927;&#x5934;&#x753B;&#x5728;&#x5C0F;&#x5C0F;&#x7684;&#x8EAB;&#x4F53;&#x4E4B;&#x4E0A;&#x4ECD;&#x7136;&#x5F88;&#x53EF;&#x7231;&#x3002;</p>
<h2 id="9&#x52A8;&#x7269;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x4E2A;&#x840C;&#x7269;">9.&#x52A8;&#x7269;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x4E2A;&#x840C;&#x7269;</h2><p>&#x4E0D;&#x8981;&#x5FD8;&#x8BB0;&#x6700;&#x53EF;&#x7231;&#x7684;&#x751F;&#x7269;&#xFF1A;&#x52A8;&#x7269;&#xFF01;&#x732B;&#x3001;&#x5154;&#x5B50;&#x3001;&#x72D7;&#x3001;&#x5C0F;&#x9E1F;&#x5C0F;&#x5B69;&#x7B49;&#x7B49;&#x3002;&#x6211;&#x4EEC;&#x559C;&#x7231;&#x52A8;&#x7269;&#xFF0C;&#x6240;&#x4EE5;&#x753B;&#x5C0F;&#x7684;&#x5706;&#x5F62;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x5F62;&#x5F0F;&#x4E5F;&#x65E0;&#x7591;&#x662F;&#x53EF;&#x7231;&#x7684;&#x8868;&#x73B0;&#x3002;<br>&#x5927;&#x8111;&#x888B;&#xFF0C;&#x5C0F;&#x8EAB;&#x4F53;&#x662F;&#x53E6;&#x4E00;&#x79CD;&#x52A8;&#x7269;&#x7684;&#x7279;&#x5F81;&#x3002;&#x60F3;&#x60F3;&#x5386;&#x53F2;&#x4E0A;&#x6700;&#x8457;&#x540D;&#x7684;&#x840C;&#x7CFB;&#x52A8;&#x7269;&#x4E4B;&#x4E00;&#xFF0C;Hello Kitty&#xFF0C;&#x5979;&#x7684;&#x6BD4;&#x4F8B;&#x548C;&#x771F;&#x6B63;&#x7684;&#x732B;&#x662F;&#x7684;&#x6BD4;&#x4F8B;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x5BF9;&#x5E94;&#x7684;&#x3002;&#x4F46;&#x5BF9;&#x4E8E;&#x840C;&#x7CFB;&#x52A8;&#x7269;&#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x662F;&#x5B8C;&#x7F8E;&#x7684;&#x3002;<br><img src="http://7xpbhk.com1.z0.glb.clouddn.com/Jump-Animal---Vector-Pack.jpg" alt="enter image description here"><br>&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x4E0A;&#x9762;&#x7684;&#x8DF3;&#x7684;&#x5706;&#x5706;&#x7684;&#x5C0F;&#x52A8;&#x7269;&#x3002;&#x770B;&#x770B;&#x4ED6;&#x4EEC;&#x662F;&#x591A;&#x4E48;&#x7B80;&#x5355;&#x53EF;&#x7231;&#x3002;&#x6241;&#x5E73;&#x7684;&#x989C;&#x8272;&#xFF0C;&#x5706;&#x89D2;&#x7684;&#x56DB;&#x80A2;&#xFF0C;&#x7B80;&#x7EA6;&#x7684;&#x6837;&#x5F0F;&#xFF0C;&#x8FF7;&#x4F60;&#x7684;&#x8138;&#x5E9E;&#x8BA9;&#x840C;&#x840C;&#x7684;&#x52A8;&#x7269;&#x8DF3;&#x5165;&#x6211;&#x4EEC;&#x7684;&#x5FC3;&#x3002;</p>
<h2 id="10&#x4E07;&#x7269;&#x7686;&#x53EF;&#x840C;">10.&#x4E07;&#x7269;&#x7686;&#x53EF;&#x840C;</h2><p>&#x6211;&#x4EEC;&#x8C08;&#x4E86;&#x98DF;&#x7269;&#xFF0C;&#x52A8;&#x7269;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x751F;&#x7269;&#xFF0C;&#x4EBA;&#x7C7B;&#xFF0C;&#x548C;&#x5929;&#x6C14;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x662F;&#x50CF;&#x7259;&#x9F7F;&#x8FD9;&#x79CD;&#x4E1C;&#x897F;&#x5462;&#xFF1F;&#x7259;&#x9F7F;&#x80FD;&#x53D8;&#x5F97;&#x840C;&#x840C;&#x7684;&#x4E48;&#xFF1F;<br>&#x7B54;&#x6848;&#x662F;&#x80AF;&#x5B9A;&#x7684;&#xFF01;&#x770B;&#x770B;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x975E;&#x5E38;&#x68D2;&#x7684;&#x4F8B;&#x5B50;&#x628A;&#x5E73;&#x5E38;&#x4E0D;&#x662F;&#x5F88;&#x53EF;&#x7231;&#x7684;&#x7EDF;&#x4E00;&#x53D8;&#x5F97;&#x8BA9;&#x5927;&#x5BB6;&#x89C9;&#x5F97;&#x5F88;&#x840C;&#x3002;&#x770B;&#x7740;&#x8FD9;&#x4E9B;&#x6D77;&#x76D7;&#x6837;&#x7684;&#x7259;&#x9F7F;&#x5C1D;&#x8BD5;&#x544A;&#x8BC9;&#x6211;&#x4F60;&#x4E0D;&#x5E0C;&#x671B;&#x8FD9;&#x4E9B;&#x53EF;&#x7231;&#x7684;&#x6D77;&#x76D7;&#x7259;&#x6302;&#x5728;&#x4F60;&#x7684;&#x5899;&#x4E0A;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x4E0D;&#x53EF;&#x80FD;&#x4E0D;&#x7528;&#x65E0;&#x804A;&#x7684;&#x53BB;&#x5C1D;&#x8BD5;&#x4E86;=&#x3002;=<br><img src="http://7xpbhk.com1.z0.glb.clouddn.com/Masquerade-%5BConverted%5D.jpg" alt="Masquerade"><br>&#x9075;&#x5B88;&#x4E0A;&#x9762;&#x7684;&#x5EFA;&#x8BAE;&#xFF0C;&#x51E0;&#x4E4E;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#xFF0C;&#x90FD;&#x80FD;&#x591F;&#x4F7F;&#x7528;&#x840C;&#x7CFB;&#x98CE;&#x683C;&#xFF1A;&#x53EF;&#x7231;&#x7684;&#x8138;&#x988A;&#xFF0C;&#x5706;&#x89D2;&#x7B49;&#x7B49;&#x3002;&#x6C7D;&#x8F66;&#xFF0C;&#x80C3;&#xFF0C;&#x954A;&#x5B50;&#xFF0C;&#x7A0E;&#x6536;&#x6587;&#x4EF6;&#x2026;.&#x4ED6;&#x4EEC;&#x90FD;&#x662F;&#x53EF;&#x7231;&#x7684;,&#x770B;&#x8D77;&#x6765;&#x5C31;&#x50CF;&#x4F60;&#x6700;&#x597D;&#x7684;&#x6700;&#x53EF;&#x7231;&#x7684;&#x6700;&#x60F9;&#x4EBA;&#x559C;&#x7231;&#x7684;&#x670B;&#x53CB;&#x3002;&#x8BD5;&#x60F3;&#x4E00;&#x4E0B;&#xFF0C;&#x8BA9;&#x90A3;&#x4E9B;&#x4EE4;&#x4EBA;&#x6BDB;&#x9AA8;&#x609A;&#x7136;&#x6216;&#x7269;&#x6216;&#x601D;&#x60F3;&#x53D8;&#x6210;&#x840C;&#x840C;&#x54D2;&#x6837;&#x5B50;&#xFF0C;&#x611F;&#x8C22;&#x8FD9;&#x79CD;&#x840C;&#x7CFB;&#x98CE;&#x683C;&#x7684;&#x5B58;&#x5728;&#x3002;</p>
<h2 id="&#x8BA9;&#x6211;&#x4EEC;&#x4F11;&#x606F;&#x4E00;&#x4E0B;">&#x8BA9;&#x6211;&#x4EEC;&#x4F11;&#x606F;&#x4E00;&#x4E0B;</h2><p>&#x65E2;&#x7136;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;10&#x4E2A;&#x5C0F;&#x8D34;&#x58EB;&#x6765;&#x8BBE;&#x8BA1;&#x840C;&#x7CFB;&#x98CE;&#x683C;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x8BA9;&#x6211;&#x4EEC;&#x5217;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x6E05;&#x5355;&#xFF1A;</p>
<ol>
<li>&#x7B80;&#x6D01;&#x662F;&#x5173;&#x952E;&#xFF1A;&#x7528;&#x6700;&#x5C11;&#x7684;&#x7EC6;&#x8282;&#x8BBE;&#x8BA1;&#x4F60;&#x7684;&#x4F5C;&#x54C1;&#x3002;</li>
<li>&#x8BA9;&#x8272;&#x76D8;&#x4FDD;&#x6301;&#x53EF;&#x7231;&#xFF1A;&#x591A;&#x5F69;&#xFF0C;&#x4EAE;&#x8272;&#xFF0C;&#x7C89;&#x5F69;&#x662F;&#x9002;&#x5408;&#x5361;&#x54C7;&#x4F0A;&#x98CE;&#x683C;&#x7684;</li>
<li>&#x8F6F;&#x6E10;&#x53D8;&#x548C;&#x5355;&#x8C03;&#x7684;&#x8272;&#x5F69;&#xFF1A;&#x6241;&#x5E73;&#x7684;&#x989C;&#x8272;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x901A;&#x8FC7;&#x8F6F;&#x6E10;&#x53D8;&#x800C;&#x4E0D;&#x521B;&#x5EFA;&#x6C89;&#x91CD;&#x7684;&#x5149;&#x6E90;</li>
<li>&#x5706;&#x7684;&#x5F62;&#x72B6;&#x548C;&#x89D2;&#xFF1A;&#x5706;&#x89D2;&#x662F;&#x53CB;&#x597D;&#x7684;&#xFF0C;&#x67D4;&#x548C;&#x7684;&#xFF0C;&#x60F9;&#x4EBA;&#x559C;&#x7231;&#x7684;</li>
<li>&#x753B;&#x4E00;&#x4E2A;&#x8138;&#xFF01;&#x8138;&#x7684;&#x610F;&#x601D;&#x662F;&#x53CB;&#x597D;&#x7684;&#xFF0C;&#x53EF;&#x7231;&#x7684;&#x8BBE;&#x8BA1;</li>
<li>&#x5236;&#x9020;&#x60C5;&#x611F;&#xFF1A;&#x5728;&#x53EF;&#x7231;&#x7684;&#x8138;&#x4E0A;&#x8868;&#x8FF0;&#x4F60;&#x7684;&#x60C5;&#x7EEA;</li>
<li>&#x98DF;&#x7269;&#xFF01;&#x840C;&#x7CFB;&#x98CE;&#x683C;&#x4E2D;&#x5E38;&#x89C1;&#x7684;&#x4E1C;&#x897F;</li>
<li>&#x5927;&#x8111;&#x888B;&#xFF0C;&#x5C0F;&#x8EAB;&#x4F53;&#xFF1A;&#x5173;&#x6CE8;&#x840C;&#x7CFB;&#x4EBA;&#x7269;&#x7684;&#x5934;&#x548C;&#x8138;</li>
<li>&#x52A8;&#x7269;&#x672C;&#x8EAB;&#x5C31;&#x5F88;&#x53EF;&#x7231;&#xFF1A;&#x5C24;&#x5176;&#x662F;&#x52A8;&#x7269;&#x5B9D;&#x5B9D;</li>
<li>&#x4E07;&#x7269;&#x7686;&#x53EF;&#x840C;&#xFF1A;&#x770B;&#x770B;&#x4F60;&#x7684;&#x529E;&#x516C;&#x684C;&#x6216;&#x5BB6;&#x91CC;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x53EF;&#x4EE5;&#x53D8;&#x5F97;&#x840C;&#x840C;&#x54D2;</li>
</ol>
<hr>
<p>&#x672C;&#x6587;&#x6839;&#x636E;<a href="http://tutsplus.com/authors/mary-winkler" target="_blank" rel="external">@Mary Winkler</a>&#x7684;&#x6587;&#x7AE0;&#x6240;&#x8BD1;&#xFF0C;&#x6574;&#x7BC7;&#x8BD1;&#x6587;&#x5E26;&#x6709;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x7406;&#x89E3;&#x548C;&#x610F;&#x601D;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x8BD1;&#x5F97;&#x4E0D;&#x597D;&#x7684;&#x5730;&#x65B9;&#x6216;&#x8005;&#x4E0D;&#x5BF9;&#x4E4B;&#x5904;&#xFF0C;&#x8FD8;&#x8BF7;&#x5927;&#x5BB6;&#x6307;&#x70B9;&#x3002;&#x82F1;&#x6587;&#x51FA;&#x5904;&#xFF1A;<a href="http://design.tutsplus.com/articles/10-top-tips-for-creating-cute-kawaii-art--cms-25705" target="_blank" rel="external">10 Top Tips for Creating Cute Kawaii Art</a></p>

      
    </div>

    <div>
      
        

      
    </div>

    <div>
      
        

      
    </div>

    <footer class="post-footer">
      
        <div class="post-tags">
          
            <a href="/tags/可爱/" rel="tag">#可爱</a>
          
            <a href="/tags/设计/" rel="tag">#设计</a>
          
        </div>
      

      
        <div class="post-nav">
          <div class="post-nav-next post-nav-item">
            
              <a href="/2016/02/22/logo/" rel="next" title="logo诞生记">
                <i class="fa fa-chevron-left"></i> logo诞生记
              </a>
            
          </div>

          <div class="post-nav-prev post-nav-item">
            
              <a href="/2016/03/05/my-way/" rel="prev" title="前端之旅">
                前端之旅 <i class="fa fa-chevron-right"></i>
              </a>
            
          </div>
        </div>
      

      
      
    </footer>
  </article>



    <div class="post-spread">
      
    </div>
  </div>


          </div>
          


          
  <div class="comments" id="comments">
    
      <div class="ds-thread" data-thread-key="2016/02/23/10-Top-Tips-for-Creating-Cute-Kawaii-Art/"
           data-title="10个小技巧创造萌系图案" data-url="http://cyseria.xyz/2016/02/23/10-Top-Tips-for-Creating-Cute-Kawaii-Art/">
      </div>
    
  </div>


        </div>
        
          
  
  <div class="sidebar-toggle">
    <div class="sidebar-toggle-line-wrap">
      <span class="sidebar-toggle-line sidebar-toggle-line-first"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-middle"></span>
      <span class="sidebar-toggle-line sidebar-toggle-line-last"></span>
    </div>
  </div>

  <aside id="sidebar" class="sidebar">
    <div class="sidebar-inner">

      

      
        <ul class="sidebar-nav motion-element">
          <li class="sidebar-nav-toc sidebar-nav-active" data-target="post-toc-wrap" >
            文章目录
          </li>
          <li class="sidebar-nav-overview" data-target="site-overview">
            站点概览
          </li>
        </ul>
      

      <section class="site-overview sidebar-panel ">
        <div class="site-author motion-element" itemprop="author" itemscope itemtype="http://schema.org/Person">
          <img class="site-author-image" itemprop="image"
               src="/images/avatar.png"
               alt="鳗鱼鱼" />
          <p class="site-author-name" itemprop="name">鳗鱼鱼</p>
          <p class="site-description motion-element" itemprop="description">这里是自己折腾的各种东西，包括前端技术文章，个人设计作品等，欢迎丢硬币丢香蕉</p>
        </div>
        <nav class="site-state motion-element">
          <div class="site-state-item site-state-posts">
            <a href="/archives">
              <span class="site-state-item-count">16</span>
              <span class="site-state-item-name">日志</span>
            </a>
          </div>

          
            <div class="site-state-item site-state-categories">
              
                <span class="site-state-item-count">4</span>
                <span class="site-state-item-name">分类</span>
              
            </div>
          

          
            <div class="site-state-item site-state-tags">
              <a href="/tags">
                <span class="site-state-item-count">17</span>
                <span class="site-state-item-name">标签</span>
              </a>
            </div>
          

        </nav>

        

        <div class="links-of-author motion-element">
          
            
              <span class="links-of-author-item">
                <a href="https://github.com/cyseria" target="_blank" title="GitHub">
                  
                    <i class="fa fa-fw fa-github"></i>
                  
                  GitHub
                </a>
              </span>
            
              <span class="links-of-author-item">
                <a href="http://weibo.com/u/1887935412" target="_blank" title="微博">
                  
                    <i class="fa fa-fw fa-globe"></i>
                  
                  微博
                </a>
              </span>
            
          
        </div>

        
        

        
        
          <div class="links-of-blogroll motion-element links-of-blogroll-inline">
            <div class="links-of-blogroll-title">
              <i class="fa  fa-fw fa-globe"></i>
              Links
            </div>
            <ul class="links-of-blogroll-list">
              
                <li class="links-of-blogroll-item">
                  <a href="http://w3ctrain.com/" title="w3ctrain" target="_blank">w3ctrain</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="http://manjusaka.itscoder.com/" title="Manjusaka" target="_blank">Manjusaka</a>
                </li>
              
                <li class="links-of-blogroll-item">
                  <a href="https://github.com/geeeeeeeeek" title="gayhub过万的奇迹哥" target="_blank">gayhub过万的奇迹哥</a>
                </li>
              
            </ul>
          </div>
        

      </section>

      
        <section class="post-toc-wrap motion-element sidebar-panel sidebar-panel-active">
          <div class="post-toc">
            
              
            
            
              <div class="post-toc-content"><ol class="nav"><li class="nav-item nav-level-2"><a class="nav-link" href="#1简约"><span class="nav-number">1.</span> <span class="nav-text">1.简约</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#2通过配色来让作品变得可爱"><span class="nav-number">2.</span> <span class="nav-text">2.通过配色来让作品变得可爱</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#3软渐变和扁平色"><span class="nav-number">3.</span> <span class="nav-text">3.软渐变和扁平色</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#4圆形和边角"><span class="nav-number">4.</span> <span class="nav-text">4.圆形和边角</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#5画一张脸"><span class="nav-number">5.</span> <span class="nav-text">5.画一张脸</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#6制造情感"><span class="nav-number">6.</span> <span class="nav-text">6.制造情感</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#7食物"><span class="nav-number">7.</span> <span class="nav-text">7.食物</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#8大头小身体"><span class="nav-number">8.</span> <span class="nav-text">8.大头小身体</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#9动物本身就是个萌物"><span class="nav-number">9.</span> <span class="nav-text">9.动物本身就是个萌物</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#10万物皆可萌"><span class="nav-number">10.</span> <span class="nav-text">10.万物皆可萌</span></a></li><li class="nav-item nav-level-2"><a class="nav-link" href="#让我们休息一下"><span class="nav-number">11.</span> <span class="nav-text">让我们休息一下</span></a></li></ol></div>
            
          </div>
        </section>
      

    </div>
  </aside>


        
      </div>
    </main>

    <footer id="footer" class="footer">
      <div class="footer-inner">
        <div class="copyright" >
  
  &copy;  2015 - 
  <span itemprop="copyrightYear">2016</span>
  <span class="with-love">
    <i class="fa fa-heart"></i>
  </span>
  <span class="author" itemprop="copyrightHolder">鳗鱼鱼</span>
</div>

        

        
      </div>
    </footer>

    <div class="back-to-top">
      <i class="fa fa-arrow-up"></i>
    </div>
  </div>

  

<script type="text/javascript">
  if (Object.prototype.toString.call(window.Promise) !== '[object Function]') {
    window.Promise = null;
  }
</script>









  



  
  <script type="text/javascript" src="/vendors/jquery/index.js?v=2.1.3"></script>

  
  <script type="text/javascript" src="/vendors/fastclick/lib/fastclick.min.js?v=1.0.6"></script>

  
  <script type="text/javascript" src="/vendors/jquery_lazyload/jquery.lazyload.js?v=1.9.7"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/velocity/velocity.ui.min.js?v=1.2.1"></script>

  
  <script type="text/javascript" src="/vendors/fancybox/source/jquery.fancybox.pack.js?v=2.1.5"></script>


  


  <script type="text/javascript" src="/js/src/utils.js?v=5.0.1"></script>

  <script type="text/javascript" src="/js/src/motion.js?v=5.0.1"></script>



  
  

  
  <script type="text/javascript" src="/js/src/scrollspy.js?v=5.0.1"></script>
<script type="text/javascript" src="/js/src/post-details.js?v=5.0.1"></script>



  


  <script type="text/javascript" src="/js/src/bootstrap.js?v=5.0.1"></script>



  

  
    
  

  <script type="text/javascript">
    var duoshuoQuery = {short_name:"manyuyu"};
    (function() {
      var ds = document.createElement('script');
      ds.type = 'text/javascript';ds.async = true;
      ds.id = 'duoshuo-script';
      ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
      ds.charset = 'UTF-8';
      (document.getElementsByTagName('head')[0]
      || document.getElementsByTagName('body')[0]).appendChild(ds);
    })();
  </script>

  
    
    <script src="/vendors/ua-parser-js/dist/ua-parser.min.js?v=0.7.9"></script>
    <script src="/js/src/hook-duoshuo.js"></script>
  






  
  

  

  

  

</body>
</html>
